Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/modules/*.po
Languages: id

source: 🏷️ ID
id: 🏷️ 编号（ID）

source: Manage entity IDs, essential in scenarios like shooting games where you need to track who is targeting whom.
id: 管理实体ID，在需要追踪谁在瞄准谁等场景（如射击游戏）中至关重要。

source: "We know what we are, but know not what we may be."
id: “我们知道自己是谁，却不知道自己能成为谁。”

source: William Shakespeare
id: 威廉·莎士比亚（William Shakespeare）

source: 🔧 Functions
id: 🔧 函数

source: You can find below all functions available in this module.
id: 你可以在下方找到此模块中的所有可用函数。

source: Give Simple Unique ID
id: 给予简单唯一ID

source: Give a unique `bs.id` score to each entity.
id: 给每个实体一个唯一的 `bs.id` 分数。

source: Inputs
id: 输入

source: **Execution `as <entities>`**: Entities to assign an ID to.
id: **执行 `as <实体>`**：要分配ID的实体。

source: Outputs
id: 输出

source: **Score `@s bs.id`**: Generated simple unique ID.
id: **分数 `@s bs.id`**：生成的简单唯一ID。

source: *Example: Give an ID to all players:*
id: *示例：给所有玩家一个ID：*

source: **Credits**: Aksiome, KubbyDev
id: **制作人员**：Aksiome、KubbyDev

source: Give Chain Unique ID
id: 给予链式唯一ID

source: Give a unique `bs.cid` score to each entity.
id: 给每个实体一个唯一的 `bs.cid` 分数。

source: **Score `@s bs.cid`**: Generated chain unique ID.
id: **分数 `@s bs.cid`**：生成的链式唯一ID。

source: How it works?
id: 工作原理？

source: The chain ID is similar to the simple ID. However, with chain IDs, you can use the function `#bs.id:update_cuids` to make sure there are no gaps in the ID sequence, thus creating a continuous chain.
id: 链式ID类似于简单ID。但是，使用链式ID时，你可以使用 `#bs.id:update_cuids` 函数来确保ID序列中没有空隙，从而创建一个连续的链。

source: Update Chain Unique ID
id: 更新链式唯一ID

source: Update all entities' CUIDs to ensure the chain is continuous.
id: 更新所有实体的链式唯一ID以确保链的连续性。

source: *Example: Ensure the chain is free of gaps and duplicates:*
id: *示例：确保链中没有空隙和重复：*

source: 👁️ Predicates
id: 👁️ 谓词

source: You can find below all predicates available in this module.
id: 你可以在下方找到此模块中的所有可用谓词。

source: Check Simple Unique ID
id: 检查简单唯一ID

source: Has
id: 拥有

source: Determine if an entity has a `bs.id` score.
id: 判断实体是否有 `bs.id` 分数。

source: *Example: Give an SUID to all entities that aren't identified by a `bs.id` score:*
id: *示例：给所有没有 `bs.id` 分数标识的实体一个简单唯一ID：*

source: Equal
id: 相等

source: Find an entity that has the same `bs.id` as the input value.
id: 查找具有与输入值相同 `bs.id` 的实体。

source: **Score `$id.suid bs.in`**: Value to check against.
id: **分数 `$id.suid bs.in`**：要检查的值。

source: *Example: Find the entity that has a `bs.id` equal to 1:*
id: *示例：查找具有 `bs.id` 等于 1 的实体：*

source: Lower
id: 小于

source: Filter entities that have a `bs.id` less than or equal to the input value.
id: 过滤出 `bs.id` 小于或等于输入值的实体。

source: *Example: Filter entities that have a `bs.id` less than or equal to 17:*
id: *示例：过滤出 `bs.id` 小于或等于 17 的实体：*

source: Upper
id: 大于

source: Filter entities that have a `bs.id` greater than or equal to the input value.
id: 过滤出 `bs.id` 大于或等于输入值的实体。

source: *Example: Filter entities that have a `bs.id` greater than or equal to 18:*
id: *示例：过滤出 `bs.id` 大于或等于 18 的实体：*

source: Match
id: 匹配

source: Filter entities that have a `bs.id` between the given values.
id: 过滤出 `bs.id` 在给定值之间的实体。

source: **Score `$id.suid.min bs.in`**: Min value to check against.
id: **分数 `$id.suid.min bs.in`**：要检查的最小值。

source: **Score `$id.suid.max bs.in`**: Max value to check against.
id: **分数 `$id.suid.max bs.in`**：要检查的最大值。

source: *Example: Filter entities that have a `bs.id` between 2 and 4:*
id: *示例：过滤出 `bs.id` 在 2 到 4 之间的实体：*

source: **Credits**: Aksiome
id: **制作人员**：Aksiome

source: Check Chain Unique ID
id: 检查链式唯一ID

source: Determine if an entity has a `bs.cid` score.
id: 判断实体是否有 `bs.cid` 分数。

source: *Example: Give a CUID to all entities that aren't identified by a `bs.cid` score:*
id: *示例：给所有没有 `bs.cid` 分数标识的实体一个链式唯一ID：*

source: Find an entity that has the same `bs.cid` as the input value.
id: 查找具有与输入值相同 `bs.cid` 的实体。

source: **Score `$id.cuid bs.in`**: Value to check against.
id: **分数 `$id.cuid bs.in`**：要检查的值。

source: *Example: Find the entity that has a `bs.cid` equal to 1:*
id: *示例：查找具有 `bs.cid` 等于 1 的实体：*

source: Filter entities that have a `bs.cid` less than or equal to the input value.
id: 过滤出 `bs.cid` 小于或等于输入值的实体。

source: *Example: Filter entities that have a `bs.cid` less than or equal to 17:*
id: *示例：过滤出 `bs.cid` 小于或等于 17 的实体：*

source: Filter entities that have a `bs.cid` greater than or equal to the input value.
id: 过滤出 `bs.cid` 大于或等于输入值的实体。

source: *Example: Filter entities that have a `bs.cid` greater than or equal to 18:*
id: *示例：过滤出 `bs.cid` 大于或等于 18 的实体：*

source: Filter entities that have a `bs.cid` between the given values.
id: 过滤出 `bs.cid` 在给定值之间的实体。

source: **Score `$id.cuid.min bs.in`**: Min value to check against.
id: **分数 `$id.cuid.min bs.in`**：要检查的最小值。

source: **Score `$id.cuid.max bs.in`**: Max value to check against.
id: **分数 `$id.cuid.max bs.in`**：要检查的最大值。

source: *Example: Filter entities that have a `bs.cid` between 2 and 4:*
id: *示例：过滤出 `bs.cid` 在 2 到 4 之间的实体：*

source: **💬 Did it help you?**
id: **💬 这对你有帮助吗？**

source: Feel free to leave your questions and feedback below!
id: 欢迎在下方留下你的问题和反馈！
