Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/modules/block.po
Languages: fr_fr, zh_cn

source: 🧱 Block
fr_fr: 🧱 Bloc
zh_cn: 🧱 方块（Block）

source: Manage blocks, including states and NBTs, while offering advanced tools for seamless transformations.
fr_fr: Gérer les blocs, y compris les états et NBT, tout en offrant des outils avancés pour les transformations fluides.
zh_cn: 管理方块，包括状态和NBT，同时提供无缝转换的高级工具。

source: "Architecture is the thoughtful making of space."
fr_fr: "L'architecture est la création réfléchie de l'espace."
zh_cn: “建筑是深思熟虑的空间创造。”

source: Louis Kahn
zh_cn: 路易斯·康（Louis Kahn）

source: Virtual Block Format
fr_fr: Format de bloc virtuel
zh_cn: 虚拟方块格式

source: To manipulate blocks and their states, Bookshelf utilizes a [virtual block format](#get) stored in the block output. It's crucial not to update the virtual block format manually; instead, utilize the helper functions provided in the library.
fr_fr: Pour manipuler les blocs et leurs états, Bookshelf utilise un [format de bloc virtuel](#get) stocké dans la sortie du bloc. Il est crucial de ne pas mettre à jour le format de bloc virtuel manuellement ; utilisez plutôt les fonctions d'aide fournies dans la bibliothèque.
zh_cn: 为了操作方块及其状态，Bookshelf 需要使用方块输出中的[虚拟方块格式](#get)。请使用库中提供的辅助函数，不要手动修改虚拟方块格式。

source: 🔧 Functions
fr_fr: 🔧 Fonctions
zh_cn: 🔧 函数

source: You can find below all functions available in this module.
fr_fr: Vous pouvez trouver ci-dessous toutes les fonctions disponibles dans ce module.
zh_cn: 你可以在下方找到此模块中的所有可用函数。

source: Fill
fr_fr: Remplir
zh_cn: 填充

source: Block
fr_fr: Bloc
zh_cn: 方块

source: Fill all or part of a region with a specific block.
fr_fr: Remplir tout ou partie d'une région avec un bloc spécifique.
zh_cn: 用指定方块填充部分或全部区域。

source: Inputs
fr_fr: Entrées
zh_cn: 输入

source: **Storage `bs:in block.fill_block`**:
fr_fr: **Stockage `bs:in block.fill_block`** :
zh_cn: **命令存储 `bs:in block.fill_block`**：

source: {nbt}`compound` Fill block data
fr_fr: {nbt}`compound` Données de remplissage de bloc
zh_cn: {nbt}`compound` 填充方块数据

source: {nbt}`string` **block**: Block to fill the region with.
fr_fr: {nbt}`string` **block** : Bloc avec lequel remplir la région.
zh_cn: {nbt}`string` **block**: 要填充的方块。

source: {nbt}`string` {nbt}`list` **from**: Starting position as a valid position string or a list of 3 elements (x, y, z).
fr_fr: {nbt}`string` {nbt}`list` **from** : Position de départ sous forme de chaîne de position valide ou de liste de 3 éléments (x, y, z).
zh_cn: {nbt}`string` {nbt}`list` **from**: 起始点坐标，可以为合法坐标字符串或者长度为3的坐标列表（x，y，z）。

source: {nbt}`string` {nbt}`list` **to**: Ending position as a valid position string or a list of 3 elements (x, y, z).
fr_fr: {nbt}`string` {nbt}`list` **to** : Position de fin sous forme de chaîne de position valide ou de liste de 3 éléments (x, y, z).
zh_cn: {nbt}`string` {nbt}`list` **to**: 结束点坐标，可以为合法坐标字符串或者长度为3的坐标列表（x，y，z）。

source: {nbt}`int` **limit**: Limit how many blocks can be set in a single tick (default: 4096).
fr_fr: {nbt}`int` **limit** : Limite du nombre de blocs pouvant être définis en un seul tick (par défaut : 4096).
zh_cn: {nbt}`int` **limit**: 一游戏刻内最多可以生成的方块数量（默认：4096）。

source: {nbt}`string` **mode**: Mode used to set blocks [destroy|keep|replace|strict] (default: replace).
fr_fr: {nbt}`string` **mode** : Mode utilisé pour définir les blocs [destroy|keep|replace|strict] (par défaut : replace).
zh_cn: {nbt}`string` **mode**: 生成方块的模式 [destroy|keep|replace|strict]（默认：replace）。

source: {nbt}`string` **on_finished**: Command executed at the end of the operation (at the location of the final block).
fr_fr: {nbt}`string` **on_finished** : Commande exécutée à la fin de l'opération (à l'emplacement du bloc final).
zh_cn: {nbt}`string` **on_finished**: 在本操作的结束位置运行的命令（最后一个方块的位置）。

source: {nbt}`list` **masks**: Determine which blocks will be replaced by the fill operation.
fr_fr: {nbt}`list` **masks** : Détermine quels blocs seront remplacés par l'opération de remplissage.
zh_cn: {nbt}`list` **masks**: 决定在填充操作时会替换哪些方块。

source: {nbt}`compound` Block mask
fr_fr: {nbt}`compound` Masque de bloc
zh_cn: {nbt}`compound` 方块蒙版

source: {nbt}`string` **block**: Block acting as a filter.
fr_fr: {nbt}`string` **block** : Bloc agissant comme filtre.
zh_cn: {nbt}`string` **block**: 要判断的方块。

source: {nbt}`bool` **negate**: Reverse the mask (default: false).
fr_fr: {nbt}`bool` **negate** : Inverser le masque (par défaut : false).
zh_cn: {nbt}`bool` **negate**: 反转蒙版（默认：false）。

source: {nbt}`int` **x**: Mask filter x offset (default: 0).
fr_fr: {nbt}`int` **x** : Décalage de filtre de masque x (par défaut : 0).
zh_cn: {nbt}`int` **x**: 蒙版x轴偏移（默认：0）。

source: {nbt}`int` **y**: Mask filter y offset (default: 0).
fr_fr: {nbt}`int` **y** : Décalage de filtre de masque y (par défaut : 0).
zh_cn: {nbt}`int` **y**: 蒙版y轴偏移（默认：0）。

source: {nbt}`int` **z**: Mask filter z offset (default: 0).
fr_fr: {nbt}`int` **z** : Décalage de filtre de masque z (par défaut : 0).
zh_cn: {nbt}`int` **z**: 蒙版z轴偏移（默认：0）。

source: Outputs
fr_fr: Sorties
zh_cn: 输出

source: **State**: Blocks are placed in the world.
fr_fr: **État** : Les blocs sont placés dans le monde.
zh_cn: **状态**：方块被放置在世界中。

source: *Example: Replace the top layer of dirt by grass and use a say command when finished:*
fr_fr: *Exemple : Remplacer la couche supérieure de terre par de l'herbe et utiliser une commande say à la fin :*
zh_cn: *示例：将顶层泥土替换为草方块，并在完成时使用say命令：*

source: *Example: Fill an area with stone a few blocks at a time:*
fr_fr: *Exemple : Remplir une zone avec de la pierre quelques blocs à la fois :*
zh_cn: *示例：每次在固定区域内填充几个石头方块：*

source: Type
zh_cn: 类型

source: Fill all or part of a region with a specific block type, preserving states and NBTs.
fr_fr: Remplir tout ou partie d'une région avec un type de bloc spécifique, en préservant les états et NBT.
zh_cn: 对部分或全部区域更改方块类型，同时保留方块状态和NBT。

source: **Storage `bs:in block.fill_type`**:
fr_fr: **Stockage `bs:in block.fill_type`** :
zh_cn: **命令存储 `bs:in block.fill_type`**：

source: {nbt}`compound` Fill type data
fr_fr: {nbt}`compound` Données de type de remplissage
zh_cn: {nbt}`compound` 填充方块类型数据

source: {nbt}`string` **type**: Block id to fill the region with.
fr_fr: {nbt}`string` **type** : ID de bloc avec lequel remplir la région.
zh_cn: {nbt}`string` **type**: 要填充的方块的id。

source: {nbt}`list` **masks**: Determine which blocks will be replaced.
fr_fr: {nbt}`list` **masks** : Détermine quels blocs seront remplacés.
zh_cn: {nbt}`list` **masks**: 决定要替换的方块。

source: *Example: Replace oak stairs with spruce stairs while preserving states and use a say command when finished:*
fr_fr: *Exemple : Remplacer les escaliers en chêne par des escaliers en épicéa tout en préservant les états et utiliser une commande say à la fin :*
zh_cn: *示例：将橡木楼梯替换为云杉木楼梯并保留方块状态，完成时使用say命令：*

source: Random
fr_fr: Aléatoire
zh_cn: 随机

source: Fill all or part of a region with random blocks or types.
fr_fr: Remplir tout ou partie d'une région avec des blocs ou types aléatoires.
zh_cn: 对部分或全部区域填充随机方块或更改方块类型。

source: **Storage `bs:in block.fill_random`**:
fr_fr: **Stockage `bs:in block.fill_random`** :
zh_cn: **命令存储 `bs:in block.fill_random`**：

source: {nbt}`compound` Fill random data
fr_fr: {nbt}`compound` Données de remplissage aléatoire
zh_cn: {nbt}`compound` 随机填充数据

source: {nbt}`list` **entries**: List of entries to pick from randomly.
fr_fr: {nbt}`list` **entries** : Liste d'entrées à choisir aléatoirement.
zh_cn: {nbt}`list` **entries**: 随机填充的方块条目。

source: {nbt}`compound` Block or type entry
fr_fr: {nbt}`compound` Entrée de bloc ou de type
zh_cn: {nbt}`compound` 方块或方块类型条目

source: {nbt}`string` **block | type**: Block or type to fill the region with.
fr_fr: {nbt}`string` **block | type** : Bloc ou type avec lequel remplir la région.
zh_cn: {nbt}`string` **block | type**: 用来填充区域的方块或方块类型。

source: {nbt}`int` **weight**: Determine the likelihood of selecting the entry (default: 1).
fr_fr: {nbt}`int` **weight** : Détermine la probabilité de sélectionner l'entrée (par défaut : 1).
zh_cn: {nbt}`int` **weight**: 指定该项目在随机选择中的权重（默认：1）。

source: *Example: Randomly fill an area with stone or air and use a say command when finished:*
fr_fr: *Exemple : Remplir aléatoirement une zone avec de la pierre ou de l'air et utiliser une commande say à la fin :*
zh_cn: *示例：用石头或空气随机填充区域，完成时使用say命令：*

source: **Credits**: Aksiome
fr_fr: **Crédits** : Aksiome
zh_cn: **制作人员**：Aksiome

source: Get
fr_fr: Obtenir
zh_cn: 获取

source: Get all data related to the block at the current location, including its state and NBTs.
fr_fr: Obtenir toutes les données relatives au bloc à l'emplacement actuel, y compris son état et ses NBT.
zh_cn: 获取当前位置方块的所有相关数据，包括其状态和NBT。

source: **Execution `at <entity>` or `positioned <x> <y> <z>`**: Position to get block data from.
fr_fr: **Exécution `at <entity>` ou `positioned <x> <y> <z>`** : Position pour obtenir les données du bloc.
zh_cn: **执行 `at <实体>` 或 `positioned <x> <y> <z>`**：获取方块数据的位置。

source: **Storage `bs:out block`**:
fr_fr: **Stockage `bs:out block`** :
zh_cn: **命令存储 `bs:out block`**：

source: {nbt}`compound` **[readonly]** Block data
fr_fr: {nbt}`compound` **[lecture seule]** Données du bloc
zh_cn: {nbt}`compound` **[只读]** 方块数据

source: {nbt}`int` **group**: Blocks within the same group share the same possible state (e.g., stairs).
fr_fr: {nbt}`int` **group** : Les blocs dans le même groupe partagent le même état possible (par ex., escaliers).
zh_cn: {nbt}`int` **group**: 在同一个组的方块共享相同的可能的方块状态（比如：所有的楼梯）。

source: {nbt}`string` **block**: Full string representation of the block `type[state]{nbt}`.
fr_fr: {nbt}`string` **block** : Représentation complète en chaîne du bloc `type[state]{nbt}`.
zh_cn: {nbt}`string` **block**: 方块的完整字符串表示`方块id[方块状态]{nbt}`。

source: {nbt}`string` **item**: Item string id associated with the block, if it exists.
fr_fr: {nbt}`string` **item** : ID de chaîne d'objet associé au bloc, s'il existe.
zh_cn: {nbt}`string` **item**: 方块对应的物品名字符串，可能不存在。

source: {nbt}`string` **type**: String representation of the id (e.g., `minecraft:stone`).
fr_fr: {nbt}`string` **type** : Représentation en chaîne de l'ID (par ex., `minecraft:stone`).
zh_cn: {nbt}`string` **type**: 方块id的字符串表示（比如：`minecraft:stone`）。

source: {nbt}`string` **state**: Represent the state of a block (e.g., `[shape=straight]`), if it exists.
fr_fr: {nbt}`string` **state** : Représentation de l'état d'un bloc (par ex., `[shape=straight]`), s'il existe.
zh_cn: {nbt}`string` **state**: 方块状态的完整字符串表示（比如：`[shape=straight]`），可能不存在。

source: {nbt}`compound` **nbt**: Data tags used by block entities, if it exists.
fr_fr: {nbt}`compound` **nbt** : Tags de données utilisés par les entités de bloc, s'ils existent.
zh_cn: {nbt}`compound` **nbt**: 方块数据的完整字符串表示，可能不存在。

source: {nbt}`compound` **properties**: Block state as properties (used by entities like falling blocks), if it exists.
fr_fr: {nbt}`compound` **properties** : État du bloc en tant que propriétés (utilisé par des entités comme les blocs tombants), s'il existe.
zh_cn: {nbt}`compound` **properties**: 方块状态的数据表示（用于下落的方块之类的实体），可能不存在。

source: {nbt}`compound` **sounds**: The sound list of a block.
fr_fr: {nbt}`compound` **sounds** : La liste des sons d'un bloc.
zh_cn: {nbt}`compound` **sounds**: 方块的声音列表。

source: {nbt}`string` **break**: The sound played when a player breaks the block.
fr_fr: {nbt}`string` **break** : Le son joué quand un joueur casse le bloc.
zh_cn: {nbt}`string` **break**: 玩家破坏方块时的声音。

source: {nbt}`string` **hit**: The sound played when a player hits the block.
fr_fr: {nbt}`string` **hit** : Le son joué quand un joueur frappe le bloc.
zh_cn: {nbt}`string` **hit**: 玩家敲击方块时的声音。

source: {nbt}`string` **fall**: The sound played when a player falls on the block.
fr_fr: {nbt}`string` **fall** : Le son joué quand un joueur tombe sur le bloc.
zh_cn: {nbt}`string` **fall**: 玩家掉在方块上时的声音。

source: {nbt}`string` **place**: The sound played when a player places the block.
fr_fr: {nbt}`string` **place** : Le son joué quand un joueur place le bloc.
zh_cn: {nbt}`string` **place**: 玩家放置方块时的声音。

source: {nbt}`string` **step**: The sound played when a player steps on the block.
fr_fr: {nbt}`string` **step** : Le son joué quand un joueur marche sur le bloc.
zh_cn: {nbt}`string` **step**: 玩家在方块上走路时的声音。

source: *Example: Get all data related to a block:*
fr_fr: *Exemple : Obtenir toutes les données relatives à un bloc :*
zh_cn: *示例：获取方块的所有相关数据：*

source: Get the block type at the current location. Although states, NBTs, and properties will be empty, state transformation functions are still available.
fr_fr: Obtenir le type de bloc à l'emplacement actuel. Bien que les états, NBT et propriétés soient vides, les fonctions de transformation d'état sont toujours disponibles.
zh_cn: 获取当前位置的方块类型。虽然此函数输出的状态、NBT和属性为空，但这不影响管理方块状态的函数的运行。

source: {nbt}`string` **block**: Full string representation of the block (only the type).
fr_fr: {nbt}`string` **block** : Représentation complète en chaîne du bloc (seulement le type).
zh_cn: {nbt}`string` **block**: 方块的完整字符串表示（仅方块类型）。

source: *Example: Get only type data related to a block (no property value is selected):*
fr_fr: *Exemple : Obtenir seulement les données de type relatives à un bloc (aucune valeur de propriété n'est sélectionnée) :*
zh_cn: *示例：仅获取方块相关的类型数据（未选择属性值）：*

source: Read-only Output
fr_fr: Sortie en lecture seule
zh_cn: 只读输出

source: The `bs:out block` output is intended to be read-only. Modifying parts manually could lead to potential bugs. That's why the module provides numerous functions capable of making modifications to the output while preserving its integrity.
fr_fr: La sortie `bs:out block` est destinée à être en lecture seule. Modifier manuellement des parties pourrait conduire à des bugs potentiels. C'est pourquoi le module fournit de nombreuses fonctions capables d'apporter des modifications à la sortie tout en préservant son intégrité.
zh_cn: `bs:out block` 输出是只读的。手动修改部分内容可能导致潜在漏洞。因此，模块提供了许多可以修改输出的函数来保证它的完整性。

source: **Credits**: Aksiome, theogiraudet
fr_fr: **Crédits** : Aksiome, theogiraudet
zh_cn: **制作人员**：Aksiome、theogiraudet

source: Manage State
fr_fr: Gérer l'état
zh_cn: 管理方块状态

source: Keep
fr_fr: Garder
zh_cn: 保留

source: Filter properties to keep only the desired ones. This function acts on the [virtual block format](#get) stored in the block output.
fr_fr: Filtrer les propriétés pour ne garder que celles désirées. Cette fonction agit sur le [format de bloc virtuel](#get) stocké dans la sortie du bloc.
zh_cn: 过滤方块状态，只保留需要的部分。此函数作用于方块输出中的[虚拟方块格式](#get)。

source: **Function macro**:
fr_fr: **Macro de fonction** :
zh_cn: **函数宏**：

source: {nbt}`compound` Arguments
zh_cn: {nbt}`compound` 参数

source: {nbt}`list` **properties**: List of properties to keep.
fr_fr: {nbt}`list` **properties** : Liste des propriétés à garder.
zh_cn: {nbt}`list` **properties**: 要保留的方块状态列表。

source: {nbt}`compound` Property data
fr_fr: {nbt}`compound` Données de propriété
zh_cn: {nbt}`compound` 方块属性数据

source: {nbt}`string` **name**: Name of the property (e.g., `shape`).
fr_fr: {nbt}`string` **name** : Nom de la propriété (par ex., `shape`).
zh_cn: {nbt}`string` **name**: 方块属性名称（比如：`shape`）。

source: **Storage `bs:out block`**: {nbt}`compound` There's no need for manual specification; rather, employ the relevant functions, such as [`get_block`](#get).
fr_fr: **Stockage `bs:out block`** : {nbt}`compound` Il n'est pas nécessaire de spécifier manuellement ; utilisez plutôt les fonctions appropriées, telles que [`get_block`](#get).
zh_cn: **命令存储 `bs:out block`**：{nbt}`compound` 无需手动指定；而是使用相关函数，如 [`get_block`](#get)。

source: **Storage `bs:out block`**: {nbt}`compound` The `block`, `state` and `properties` are updated to reflect this change.
fr_fr: **Stockage `bs:out block`** : {nbt}`compound` Les valeurs `block`, `state` et `properties` sont mises à jour pour refléter ce changement.
zh_cn: **命令存储 `bs:out block`**：{nbt}`compound` `block`、`state` 和 `properties` 会在运行后同步更新。

source: *Example: Keep only the facing and shape properties:*
fr_fr: *Exemple : Garder seulement les propriétés facing et shape :*
zh_cn: *示例：仅保留朝向和形状的方块状态：*

source: Merge
fr_fr: Fusionner
zh_cn: 合并

source: Merge state properties from the current location into the output. The merge occurs if the syntax is correct, regardless of logical coherence (e.g., using 'age' for different plants). This function acts on the [virtual block format](#get) stored in the block output.
fr_fr: Fusionner les propriétés d'état de l'emplacement actuel dans la sortie. La fusion se produit si la syntaxe est correcte, indépendamment de la cohérence logique (par ex., utiliser 'age' pour différentes plantes). Cette fonction agit sur le [format de bloc virtuel](#get) stocké dans la sortie du bloc.
zh_cn: 将执行位置的方块状态合并更新到方块输出中。只要格式正确就进行合并更新，不考虑值是否合理（例如，对不同的植物使用“age”）。此函数作用于方块输出中的[虚拟方块格式](#get)。

source: **Execution `at <entity>` or `positioned <x> <y> <z>`**: Location of the block that act as input.
fr_fr: **Exécution `at <entity>` ou `positioned <x> <y> <z>`** : Emplacement du bloc qui agit comme entrée.
zh_cn: **执行 `at <实体>` 或 `positioned <x> <y> <z>`**：作为输入的方块位置。

source: {nbt}`list` **properties**: List of properties to merge.
fr_fr: {nbt}`list` **properties** : Liste des propriétés à fusionner.
zh_cn: {nbt}`list` **properties**: 要合并的方块状态列表。

source: *Example: Merge the facing of a block onto stairs:*
fr_fr: *Exemple : Fusionner la direction d'un bloc sur des escaliers :*
zh_cn: *示例：将某个方块的朝向合并更新到楼梯上：*

source: Remove
fr_fr: Retirer
zh_cn: 移除

source: Filter properties by removing the undesired ones. This function acts on the [virtual block format](#get) stored in the block output.
fr_fr: Filtrer les propriétés en retirant celles indésirées. Cette fonction agit sur le [format de bloc virtuel](#get) stocké dans la sortie du bloc.
zh_cn: 过滤方块状态，移除不需要的部分。此函数作用于方块输出中的[虚拟方块格式](#get)。

source: {nbt}`list` **properties**: List of properties to remove.
fr_fr: {nbt}`list` **properties** : Liste des propriétés à retirer.
zh_cn: {nbt}`list` **properties**: 要移除的方块状态列表。

source: *Example: Remove the facing and shape properties:*
fr_fr: *Exemple : Retirer les propriétés facing et shape :*
zh_cn: *示例：移除朝向和形状属性：*

source: Replace
fr_fr: Remplacer
zh_cn: 替换

source: Replace property values. Invalid values will not be replaced. This function acts on the [virtual block format](#get) stored in the block output.
fr_fr: Remplacer les valeurs de propriété. Les valeurs invalides ne seront pas remplacées. Cette fonction agit sur le [format de bloc virtuel](#get) stocké dans la sortie du bloc.
zh_cn: 替换方块状态。无效的方块状态不会被替换。此函数作用于方块输出中的[虚拟方块格式](#get)。

source: {nbt}`list` **properties**: List of properties to replace.
fr_fr: {nbt}`list` **properties** : Liste des propriétés à remplacer.
zh_cn: {nbt}`list` **properties**: 要替换的方块状态列表。

source: {nbt}`string` **name**: Name of the property (e.g., `facing`).
fr_fr: {nbt}`string` **name** : Nom de la propriété (par ex., `shape`).
zh_cn: {nbt}`string` **name**: 方块属性名称（比如：`shape`）。

source: {nbt}`string` **value**: Value of the property (e.g., `east`).
fr_fr: {nbt}`string` **value** : Valeur de la propriété (par ex., `east`).
zh_cn: {nbt}`string` **value**: 方块属性值（比如：`east`）。

source: *Example: Replace the facing property value:*
fr_fr: *Exemple : Remplacer la valeur de la propriété facing :*
zh_cn: *示例：替换朝向方块状态：*

source: Shift
fr_fr: Décaler
zh_cn: 偏移

source: Shift properties by any amount, allowing cycling through their values. This function acts on the [virtual block format](#get) stored in the block output.
fr_fr: Décaler les propriétés de n'importe quelle quantité, permettant de parcourir leurs valeurs. Cette fonction agit sur le [format de bloc virtuel](#get) stocké dans la sortie du bloc.
zh_cn: 按任意步长循环轮换方块状态。此函数作用于方块输出中的[虚拟方块格式](#get)。

source: {nbt}`list` **properties**: List of properties to shift.
fr_fr: {nbt}`list` **properties** : Liste des propriétés à décaler.
zh_cn: {nbt}`list` **properties**: 要偏移的方块状态列表。

source: {nbt}`string` **by**: Shift amount (defaults to 1).
fr_fr: {nbt}`string` **by** : Quantité de décalage (par défaut 1).
zh_cn: {nbt}`string` **by**: 偏移数量（默认为1）。

source: *Example: Shift the facing property value by 2:*
fr_fr: *Exemple : Décaler la valeur de la propriété facing de 2 :*
zh_cn: *示例：将朝向属性值偏移2：*

source: Manage Type
fr_fr: Gérer le type
zh_cn: 管理方块类型

source: Replace the block type while trying to conserve the state. State is preserved only if the group of the output matches the input. This function acts on the [virtual block format](#get) stored in the block output.
fr_fr: Remplacer le type de bloc tout en essayant de conserver l'état. L'état est préservé seulement si le groupe de la sortie correspond à l'entrée. Cette fonction agit sur le [format de bloc virtuel](#get) stocké dans la sortie du bloc.
zh_cn: 替换方块类型。仅当方块输出的方块类型和宏输入的方块类型属于同一个组别（group）时，保留方块状态。此函数作用于方块输出中的[虚拟方块格式](#get)。

source: **Return**: Whether a type was found and the replacement occurred.
fr_fr: **Retour** : Si un type a été trouvé et que le remplacement a eu lieu.
zh_cn: **返回值**：是否找到了方块类型并进行了替换。

source: *Example: Replace oak stairs with spruce stairs, preserving the current state:*
fr_fr: *Exemple : Remplacer les escaliers en chêne par des escaliers en épicéa, en préservant l'état actuel :*
zh_cn: *示例：将橡木楼梯替换为云杉木楼梯，并保留当前状态：*

source: Map
fr_fr: Mapper
zh_cn: 映射

source: Swap related block types while ensuring coherent replacements within the defined mapping registry. A mapping registry is defined as follows:
fr_fr: Échanger des types de blocs liés tout en assurant des remplacements cohérents dans le registre de mappage défini. Un registre de mappage est défini comme suit :
zh_cn: 根据预定义的映射规则，将方块输出的属性（attr）替换为输入方块的属性（attr），生成新的方块类型。注册表定义如下：

source: This function operates on the [virtual block format](#get) stored in the block output. It replaces the type in the output with one that belongs to the same set and better matches the attributes of the inputted type.
fr_fr: Cette fonction opère sur le [format de bloc virtuel](#get) stocké dans la sortie du bloc. Elle remplace le type dans la sortie par un qui appartient au même ensemble et correspond mieux aux attributs du type entré.
zh_cn: 此函数作用于方块输出中的[虚拟方块格式](#get)。它会根据注册表，在方块输出类型（type）所在的集合（set）内选择更匹配输入方块属性（attrs）的方块并输出。

source: For example, with the above mapping registry: if the input is `minecraft:red_wool` (attrs:["red"]), and the virtual block type is `minecraft:green_carpet` (set:"carpet"), the resulting block will be `minecraft:red_carpet` (set:"carpet",attrs:["red"]).
fr_fr: Par exemple, avec le registre de mappage ci-dessus : si l'entrée est `minecraft:red_wool` (attrs:["red"]), et que le type de bloc virtuel est `minecraft:green_carpet` (set:"carpet"), le bloc résultant sera `minecraft:red_carpet` (set:"carpet",attrs:["red"]).
zh_cn: 例如，使用上述映射注册表：如果输入是 `minecraft:red_wool`（attrs:["red"]），且虚拟方块类型是 `minecraft:green_carpet`（set:"carpet"），则结果方块将是 `minecraft:red_carpet`（set:"carpet",attrs:["red"]）。

source: Bookshelf includes two predefined mapping registries (`bs.shapes` and `bs.colors`). If these are insufficient, you can [create your own](#custom-mapping-registry).
fr_fr: Bookshelf inclut deux registres de mappage prédéfinis (`bs.shapes` et `bs.colors`). Si ceux-ci sont insuffisants, vous pouvez [créer le vôtre](#custom-mapping-registry).
zh_cn: Bookshelf 包含两个预定义的映射注册表（`bs.shapes` 和 `bs.colors`）。如果这些不够用，你可以[创建自己的](#custom-mapping-registry)。

source: {nbt}`string` **mapping_registry**: A path to the mapping registry used for the replacement (e.g., `bs.shapes`).
fr_fr: {nbt}`string` **mapping_registry** : Un chemin vers le registre de mappage utilisé pour le remplacement (par ex., `bs.shapes`).
zh_cn: {nbt}`string` **mapping_registry**: 一个映射表的nbt路径（比如：`bs.shapes`），用于替换。
