Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/modules/block.po
Languages: fr_fr, zh_cn

source: *Example: Replace all oak-related blocks with spruce ones (the function replaces the oak stairs block with a spruce stairs block):*
fr_fr: *Exemple : Remplacer tous les blocs liés au chêne par ceux en épicéa (la fonction remplace le bloc d'escalier en chêne par un bloc d'escalier en épicéa) :*
zh_cn: *示例：将所有橡木相关方块替换为云杉木（该函数将橡木楼梯方块替换为云杉木楼梯方块）：*

source: Mix
fr_fr: Mélanger
zh_cn: 混合

source: Experimental
fr_fr: Expérimental
zh_cn: 实验性

source: This function may sometimes behave unpredictably due to the arbitrary nature of block relationship definitions. Additionally, while the provided registries aim to cover a wide range of blocks, they are handcrafted and therefore not exhaustive.
fr_fr: Cette fonction peut parfois se comporter de manière imprévisible en raison de la nature arbitraire des définitions de relations de blocs. De plus, bien que les registres fournis visent à couvrir un large éventail de blocs, ils sont faits à la main et donc non exhaustifs.
zh_cn: 由于方块关系定义存在主观性，此函数的运行结果可能不尽人意。同时，其注册表虽涵盖大量常见方块，但基于人工整理收集，无法保证全面性。

source: Mix block types while ensuring coherent replacements within the defined mapping registry. A mapping registry is defined as follows:
fr_fr: Mélanger les types de blocs tout en assurant des remplacements cohérents dans le registre de mappage défini. Un registre de mappage est défini comme suit :
zh_cn: 根据预定义的映射规则，将方块输出的属性和输入方块的属性混合，生成新的方块类型。注册表定义如下：

source: This function operates on the [virtual block format](#get) stored in the block output. It replaces the type in the output with one that belongs to the same set and better matches the attributes of both the output and input types while prioritizing the input type.
fr_fr: Cette fonction opère sur le [format de bloc virtuel](#get) stocké dans la sortie du bloc. Elle remplace le type dans la sortie par un qui appartient au même ensemble et correspond mieux aux attributs des types de sortie et d'entrée tout en priorisant le type d'entrée.
zh_cn: 此函数会读取并更改输出的block中的[虚拟方块格式](#get)。它会根据注册表，先混合方块输出的类型（type）属性（attr）和输入方块的属性（attr），再根据混合后的属性，在方块输出所在的集合（set）内选择更匹配的方块并输出。

source: For example, with the above mapping registry: if the input is `minecraft:bricks` (attrs:["brick"]), and the virtual block type is `minecraft:stone_stairs` (set:"stairs",attrs:["stone"]), the resulting block will be `minecraft:stone_brick_stairs` (set:"stairs",attrs:["stone","brick"]).
fr_fr: Par exemple, avec le registre de mappage ci-dessus : si l'entrée est `minecraft:bricks` (attrs:["brick"]), et que le type de bloc virtuel est `minecraft:stone_stairs` (set:"stairs",attrs:["stone"]), le bloc résultant sera `minecraft:stone_brick_stairs` (set:"stairs",attrs:["stone","brick"]).
zh_cn: 例如，使用上述映射注册表：如果输入是 `minecraft:bricks`（attrs:["brick"]），且虚拟方块类型是 `minecraft:stone_stairs`（set:"stairs",attrs:["stone"]），则结果方块将是 `minecraft:stone_brick_stairs`（set:"stairs",attrs:["stone","brick"]）。

source: *Example: Mix a mossy cobblestone block with bricks resulting in a mossy stone bricks block:*
fr_fr: *Exemple : Mélanger un bloc de pierre moussue avec des briques résultant en un bloc de briques de pierre moussue :*
zh_cn: *示例：将苔石方块与砖块混合，得到苔石砖：*

source: Lookup Item
fr_fr: Rechercher un objet
zh_cn: 查找物品

source: Get block data from the given item string id.
fr_fr: Obtenir les données de bloc à partir de l'ID de chaîne d'objet donné.
zh_cn: 从给定的物品字符串ID获取方块数据。

source: {nbt}`string` **item**: Item string id associated to a block.
fr_fr: {nbt}`string` **item** : ID de chaîne d'objet associé à un bloc.
zh_cn: {nbt}`string` **item**: 方块对应的物品的字符串id。

source: **Storage `bs:out block`**: {nbt}`compound` Equivalent to the [`#bs.block:get_type`](#get) function.
fr_fr: **Stockage `bs:out block`** : {nbt}`compound` Équivalent à la fonction [`#bs.block:get_type`](#get).
zh_cn: **命令存储 `bs:out block`**：{nbt}`compound` 等同于 [`#bs.block:get_type`](#get) 函数。

source: *Example: Get block data for the stone item:*
fr_fr: *Exemple : Obtenir les données de bloc pour l'objet pierre :*
zh_cn: *示例：获取石头物品的方块数据：*

source: Minecraft does not perfectly map between blocks and items. Some items may correspond to multiple blocks, and this function will only return one of them.
fr_fr: Minecraft ne mappe pas parfaitement entre les blocs et les objets. Certains objets peuvent correspondre à plusieurs blocs, et cette fonction ne retournera qu'un seul d'entre eux.
zh_cn: Minecraft在方块和物品之间的映射并不完美。某些物品可能对应多个方块，此函数只会返回其中之一。

source: Lookup Type
fr_fr: Rechercher un type
zh_cn: 查找类型

source: Get block data from the given type string id.
fr_fr: Obtenir les données de bloc à partir de l'ID de chaîne de type donné.
zh_cn: 从给定的类型字符串ID获取方块数据。

source: {nbt}`string` **type**: Type string id associated to a block.
fr_fr: {nbt}`string` **type** : ID de chaîne de type associé à un bloc.
zh_cn: {nbt}`string` **type**: 方块对应的方块类型的字符串id。

source: *Example: Get block data for the stone type:*
fr_fr: *Exemple : Obtenir les données de bloc pour le type pierre :*
zh_cn: *示例：获取石头类型的方块数据：*

source: Match
fr_fr: Correspondre
zh_cn: 匹配

source: Determine if the block at the specified location matches the provided one.
fr_fr: Déterminer si le bloc à l'emplacement spécifié correspond à celui fourni.
zh_cn: 检查当前位置是否和给定方块匹配。

source: **Execution `at <entity>` or `positioned <x> <y> <z>`**: Location of the block to check.
fr_fr: **Exécution `at <entity>` ou `positioned <x> <y> <z>`** : Emplacement du bloc à vérifier.
zh_cn: **执行 `at <实体>` 或 `positioned <x> <y> <z>`**：要检查的方块位置。

source: **Storage `bs:in block.match.block`**: {nbt}`string` Full string representation of the block to check against.
fr_fr: **Stockage `bs:in block.match.block`** : {nbt}`string` Représentation complète en chaîne du bloc à vérifier.
zh_cn: **命令存储 `bs:in block.match.block`**：{nbt}`string` 要检查的方块的完整字符串表示。

source: **Return**: Whether the check is a success or a failure (1 or 0).
fr_fr: **Retour** : Si la vérification est un succès ou un échec (1 ou 0).
zh_cn: **返回值**：检查是否成功或失败（1或0）。

source: *Example: Check that the block at 0 0 0 matches the block at 0 1 0:*
fr_fr: *Exemple : Vérifier que le bloc à 0 0 0 correspond au bloc à 0 1 0 :*
zh_cn: *示例：检查0 0 0处的方块是否匹配0 1 0处的方块：*

source: Set
fr_fr: Définir
zh_cn: 放置

source: Place a block at the current location.
fr_fr: Placer un bloc à l'emplacement actuel.
zh_cn: 在当前位置放置方块。

source: **Execution `at <entity>` or `positioned <x> <y> <z>`**: Position to set the block to.
fr_fr: **Exécution `at <entity>` ou `positioned <x> <y> <z>`** : Position pour définir le bloc.
zh_cn: **执行 `at <实体>` 或 `positioned <x> <y> <z>`**：要放置方块的位置。

source: **Storage `bs:in block.set_block`**:
fr_fr: **Stockage `bs:in block.set_block`** :
zh_cn: **命令存储 `bs:in block.set_block`**：

source: {nbt}`compound` Set block data
fr_fr: {nbt}`compound` Données de définition de bloc
zh_cn: {nbt}`compound` 放置方块数据

source: {nbt}`string` **block**: Full string representation of the block to set.
fr_fr: {nbt}`string` **block** : Représentation complète en chaîne du bloc à définir.
zh_cn: {nbt}`string` **block**: 要放置的方块的完整字符串表示。

source: {nbt}`string` **mode**: Mode used to set the block [destroy|keep|replace|strict] (default: replace).
fr_fr: {nbt}`string` **mode** : Mode utilisé pour définir le bloc [destroy|keep|replace|strict] (par défaut : replace).
zh_cn: {nbt}`string` **mode**: 放置方块的模式 [destroy|keep|replace|strict] （默认: replace）。

source: **State**: A block is placed in the world.
fr_fr: **État** : Les blocs sont placés dans le monde.
zh_cn: **状态**：方块被放置在世界中。

source: *Example: Place a block of stone at 0 0 0 by destroying the existing one:*
fr_fr: *Exemple : Placer un bloc de pierre à 0 0 0 en détruisant le bloc existant :*
zh_cn: *示例：在0 0 0处放置石头方块并破坏已有方块：*

source: Replace the block type at the current location while trying to conserve its state and NBTs.
fr_fr: Remplacer le type de bloc à l'emplacement actuel tout en essayant de conserver son état et ses NBT.
zh_cn: 在尝试保留方块状态和NBT的同时替换当前位置的方块类型。

source: **Storage `bs:in block.set_type`**:
fr_fr: **Stockage `bs:in block.set_type`** :
zh_cn: **命令存储 `bs:in block.set_type`**：

source: {nbt}`compound` Set type data
fr_fr: {nbt}`compound` Données de définition de bloc
zh_cn: {nbt}`compound` 放置方块数据

source: {nbt}`string` **type**: String representation of the block id to set.
fr_fr: {nbt}`string` **type** : Représentation en chaîne de l'ID de bloc à définir.
zh_cn: {nbt}`string` **block**: 要放置的方块id的字符串表示。

source: *Example: Replace any stairs with oak stairs, preserving the current state:*
fr_fr: *Exemple : Remplacer tous les escaliers par des escaliers en chêne, en préservant l'état actuel :*
zh_cn: *示例：将所有楼梯替换为橡木楼梯，并保留方块状态：*

source: Produce
fr_fr: Produire
zh_cn: 生成

source: Block Display
fr_fr: Affichage de bloc
zh_cn: 方块展示实体

source: Spawn a block display representing the given block.
fr_fr: Générer un affichage de bloc représentant le bloc donné.
zh_cn: 生成给定方块对应的方块展示实体。

source: **Execution `at <entity>` or `positioned <x> <y> <z>`**: Position where the entity will be summoned.
fr_fr: **Exécution `at <entity>` ou `positioned <x> <y> <z>`** : Position où l'entité sera invoquée.
zh_cn: **执行 `at <实体>` 或 `positioned <x> <y> <z>`**：实体生成的位置。

source: **Storage `bs:in block.spawn_block_display`**:
fr_fr: **Stockage `bs:in block.spawn_block_display`** :
zh_cn: **命令存储 `bs:in block.spawn_block_display`**：

source: {nbt}`compound` Block display data
fr_fr: {nbt}`compound` Données d'affichage de bloc
zh_cn: {nbt}`compound` 方块展示实体数据

source: {nbt}`string` **type**: Block type (similar to block output).
fr_fr: {nbt}`string` **type** : Type de bloc (similaire à la sortie de bloc).
zh_cn: {nbt}`string` **type**: 方块类型（和方块输出（bs:out block）类似）。

source: {nbt}`compound` **properties**: Block properties (similar to block output).
fr_fr: {nbt}`compound` **properties** : Propriétés de bloc (similaires à la sortie de bloc).
zh_cn: {nbt}`compound` **properties**: 方块属性（和方块输出（bs:out block）类似）。

source: {nbt}`compound` **extra_nbt**: Additional NBTs to summon the entity with.
fr_fr: {nbt}`compound` **extra_nbt** : NBT supplémentaires pour invoquer l'entité.
zh_cn: {nbt}`compound` **extra_nbt**: 生成实体附加的NBT数据。

source: **State**: The entity is summoned.
fr_fr: **État** : L'entité est invoquée.
zh_cn: **状态**：生成的实体。

source: *Example: Summon a block display using the block at 0 0 0:*
fr_fr: *Exemple : Invoquer un affichage de bloc en utilisant le bloc à 0 0 0 :*
zh_cn: *示例：使用0 0 0处的方块生成方块展示实体：*

source: Falling Block
fr_fr: Bloc tombant
zh_cn: 下落的方块

source: Spawn a falling block representing the given block.
fr_fr: Générer un bloc tombant représentant le bloc donné.
zh_cn: 生成给定方块对应的下落的方块。

source: **Storage `bs:in block.spawn_falling_block`**:
fr_fr: **Stockage `bs:in block.spawn_falling_block`** :
zh_cn: **命令存储 `bs:in block.spawn_falling_block`**：

source: {nbt}`compound` Falling block data
fr_fr: {nbt}`compound` Données de bloc tombant
zh_cn: {nbt}`compound` 下落的方块数据

source: *Example: Summon a falling block using the block at 0 0 0:*
fr_fr: *Exemple : Invoquer un bloc tombant en utilisant le bloc à 0 0 0 :*
zh_cn: *示例：使用0 0 0处的方块生成下落的方块：*

source: Solid Block Display
fr_fr: Affichage de bloc solide
zh_cn: 带碰撞的方块展示实体

source: Spawn a block display with a hitbox, representing the given block.
fr_fr: Générer un affichage de bloc avec une hitbox, représentant le bloc donné.
zh_cn: 生成给定方块对应的方块展示实体，并且有和方块一样的碰撞逻辑。

source: **Storage `bs:in block.spawn_solid_block_display`**:
fr_fr: **Stockage `bs:in block.spawn_solid_block_display`** :
zh_cn: **命令存储 `bs:in block.spawn_solid_block_display`**：

source: *Example: Summon a block display with a hitbox using the block at 0 0 0:*
fr_fr: *Exemple : Invoquer un affichage de bloc avec une hitbox en utilisant le bloc à 0 0 0 :*
zh_cn: *示例：使用0 0 0处的方块生成带碰撞箱的方块展示实体：*

source: Block Particle
fr_fr: Particule de bloc
zh_cn: 方块粒子

source: Emit block particle of the given block.
fr_fr: Émettre une particule de bloc du bloc donné.
zh_cn: 发射给定方块对应的方块粒子。

source: **Execution `at <entity>` or `positioned <x> <y> <z>`**: Position where the particle will be emitted.
fr_fr: **Exécution `at <entity>` ou `positioned <x> <y> <z>`** : Position où la particule sera émise.
zh_cn: **执行 `at <实体>` 或 `positioned <x> <y> <z>`**：粒子被发射的位置。

source: **Storage `bs:in block.emit_block_particle`**:
fr_fr: **Stockage `bs:in block.emit_block_particle`** :
zh_cn: **命令存储 `bs:in block.emit_block_particle`**：

source: {nbt}`compound` Block particle data
fr_fr: {nbt}`compound` Données de particule de bloc
zh_cn: {nbt}`compound` 方块粒子数据

source: {nbt}`string` **delta**: X Y Z coordinates, the motion value of the particle (default: `0 0 0`).
fr_fr: {nbt}`string` **delta** : Coordonnées X Y Z, la valeur de mouvement de la particule (par défaut : `0 0 0`).
zh_cn: {nbt}`string` **delta**: X Y Z 坐标, 粒子的motion值（默认：`0 0 0`）。

source: {nbt}`int` **speed**: Speed of the particle (default: `1`).
fr_fr: {nbt}`int` **speed** : Vitesse de la particule (par défaut : `1`).
zh_cn: {nbt}`int` **speed**: 粒子的速度（默认：`1`）。

source: {nbt}`int` **count**: Number of particle (default: `1`).
fr_fr: {nbt}`int` **count** : Nombre de particules (par défaut : `1`).
zh_cn: {nbt}`int` **count**: 粒子的数量（默认：`1`）。

source: {nbt}`string` **mode**: Display mode: `normal` or `force` (default: `normal`).
fr_fr: {nbt}`string` **mode** : Mode d'affichage : `normal` ou `force` (par défaut : `normal`).
zh_cn: {nbt}`string` **mode**: 显示模式：`normal`或`force`（默认：`normal`）。

source: {nbt}`string` **viewers**: Control which player should view this particle (default: `@a`).
fr_fr: {nbt}`string` **viewers** : Contrôle quels joueurs doivent voir cette particule (par défaut : `@a`).
zh_cn: {nbt}`string` **viewers**: 控制哪些玩家能看到这些粒子（默认：`@a`）。

source: **State**: The particle is emitted.
fr_fr: **État** : La particule est émise.
zh_cn: **状态**：粒子被发射。

source: *Example: Emit the particle of the block at 0 0 0:*
fr_fr: *Exemple : Émettre la particule du bloc à 0 0 0 :*
zh_cn: *示例：发射0 0 0处方块的粒子：*

source: Block Sound
fr_fr: Son de bloc
zh_cn: 方块音效

source: Play a block sound of the given block.
fr_fr: Jouer un son de bloc du bloc donné.
zh_cn: 播放给定方块对应的方块音效。

source: **Execution `at <entity>` or `positioned <x> <y> <z>`**: Position where the sound will be played.
fr_fr: **Exécution `at <entity>` ou `positioned <x> <y> <z>`** : Position où le son sera joué.
zh_cn: **执行 `at <实体>` 或 `positioned <x> <y> <z>`**：音效将被播放的位置。

source: **Storage `bs:in block.play_block_sound`**:
fr_fr: **Stockage `bs:in block.play_block_sound`** :
zh_cn: **命令存储 `bs:in block.play_block_sound`**：

source: {nbt}`compound` Block sound data
fr_fr: {nbt}`compound` Données de son de bloc
zh_cn: {nbt}`compound` 方块声音数据

source: {nbt}`string` **sound**: Sound to play. Found in the `sounds` property of the virtual block (cf get functions).
fr_fr: {nbt}`string` **sound** : Son à jouer. Trouvé dans la propriété `sounds` du bloc virtuel (cf fonctions get).
zh_cn: {nbt}`string` **sound**: 要播放的声音。在虚拟方块的`sounds`属性中查找（参见 get 函数）。

source: {nbt}`string` **source**: Source of the sound: `master`, `music`, `record`, `weather`, `block`, `hostile`, `neutral`, `player`, `ambient`, or `voice` (default: `master`).
fr_fr: {nbt}`string` **source** : Source du son : `master`, `music`, `record`, `weather`, `block`, `hostile`, `neutral`, `player`, `ambient` ou `voice` (par défaut : `master`).
zh_cn: {nbt}`string` **source**: 声音来源：`master`、`music`、`record`、`weather`、`block`、`hostile`、`neutral`、`player`、`ambient` 或 `voice`（默认：`master`）。

source: {nbt}`string` **targets**: The targets of the sound (default: `@s`).
fr_fr: {nbt}`string` **targets** : Les cibles du son (par défaut : `@s`).
zh_cn: {nbt}`string` **targets**: 声音的目标（默认：`@s`）。

source: {nbt}`string` **pos**: X Y Z coordinates, the position of the sound (default: `~ ~ ~`).
fr_fr: {nbt}`string` **pos** : Coordonnées X Y Z, la position du son (par défaut : `~ ~ ~`).
zh_cn: {nbt}`string` **pos**: X Y Z 坐标，声音播放的位置（默认：`~ ~ ~`）。

source: {nbt}`int` **pitch**: Pitch of the sound (default: `1`).
fr_fr: {nbt}`int` **pitch** : Hauteur du son (par défaut : `1`).
zh_cn: {nbt}`int` **pitch**: 声音的音调（默认：`1`）。

source: {nbt}`int` **volume**: Volume of the sound (default: `1`).
fr_fr: {nbt}`int` **volume** : Volume du son (par défaut : `1`).
zh_cn: {nbt}`int` **volume**: 声音的音量（默认：`1`）。

source: {nbt}`int` **min_volume**: Minimum volume of the sound (default: `0`).
fr_fr: {nbt}`int` **min_volume** : Volume minimum du son (par défaut : `0`).
zh_cn: {nbt}`int` **min_volume**: 声音的最小音量（默认：`0`）。

source: **State**: The sound is played.
fr_fr: **État** : Le son est joué.
zh_cn: **状态**：音效被播放。

source: *Example: Play the sound of the block at 0 0 0:*
fr_fr: *Exemple : Jouer le son du bloc à 0 0 0 :*
zh_cn: *示例：播放0 0 0处方块的音效：*

source: 🎓 Custom Mapping Registry
fr_fr: 🎓 Registre de mappage personnalisé
zh_cn: 🎓 自定义映射注册表

source: This module allows you to create a personalized mapping registry tailored to your specific needs.
fr_fr: Ce module vous permet de créer un registre de mappage personnalisé adapté à vos besoins spécifiques.
zh_cn: 此模块允许你创建根据特定需求定制的个性化映射注册表。

source: To create a new registry, you need to define an array within the `bs:const block.mapping_registry` storage. Each new registry should be namespaced, and each element must include `set`, `attrs`, and `type`. Here's how you can define a new mapping registry:
fr_fr: Pour créer un nouveau registre, vous devez définir un tableau dans le stockage `bs:const block.mapping_registry`. Chaque nouveau registre doit être avec un espace de noms, et chaque élément doit inclure `set`, `attrs` et `type`. Voici comment définir un nouveau registre de mappage :
zh_cn: 要创建新的注册表，你需要在 `bs:const block.mapping_registry` 命令存储中定义一个数组。每个新注册表都应该有命名空间，且每个元素必须包含 `set`、`attrs` 和 `type`。以下是定义新映射注册表的方法：

source: **💬 Did it help you?**
fr_fr: **💬 Cela vous a-t-il aidé ?**
zh_cn: **💬 这对你有帮助吗？**

source: Feel free to leave your questions and feedback below!
fr_fr: N'hésitez pas à laisser vos questions et commentaires ci-dessous !
zh_cn: 欢迎在下方留下你的问题和反馈！
