Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/modules/index.po
Languages: fr_fr, zh_cn

source: Runtime
zh_cn: 运行时模块（Runtime）

source: Development
fr_fr: Développement
zh_cn: 开发模块（Development）

source: Prefabs
zh_cn: 预制件（Prefabs）

source: 🧩 Modules
zh_cn: 🧩 模块

source: Bookshelf is designed with modularity in mind. Features that serve a common purpose are organized into distinct, standalone, namespaced modules.
fr_fr: Bookshelf est conçu avec la modularité à l'esprit. Les fonctionnalités qui servent un objectif commun sont organisées en modules distincts, autonomes et avec espaces de noms.
zh_cn: Bookshelf ​采用模块化设计理念，​将实现统一功能的特性归入独立的、带命名空间的单独模块。

source: 🌟 Featured Modules
fr_fr: 🌟 Modules en vedette
zh_cn: 🌟 精选模块

source: 🧱 Block
zh_cn: 🧱 方块

source: Get and manipulate blocks (supports BlockStates and NBT).
fr_fr: Obtenir et manipuler des blocs (prend en charge BlockStates et NBT).
zh_cn: 获取和操作方块（支持 BlockStates 和 NBT）。

source: 🔦 Raycast
zh_cn: 🔦 射线追踪

source: Cast rays and see if they collide with blocks or entities.
fr_fr: Lancer des rayons et voir s'ils entrent en collision avec des blocs ou des entités.
zh_cn: 发射光线并检测它们是否与方块或实体发生碰撞。

source: 🧮 Math
zh_cn: 🧮 数学

source: Mathematical functions: sin, cos, exp, log, sqrt, and much more!
fr_fr: Fonctions mathématiques : sin, cos, exp, log, sqrt, et bien plus !
zh_cn: 数学函数：三角函数、指数、对数、开方等等！

source: 🏗️ Generation
fr_fr: 🏗️ Génération
zh_cn: 🏗️ 生成

source: Generate terrains and landscapes, incorporating natural features.
fr_fr: Générer des terrains et paysages, incorporant des caractéristiques naturelles.
zh_cn: 生成包含自然地貌的地形和景观。

source: 🎲 Random
zh_cn: 🎲 随机

source: Random functions for different distributions and noise patterns.
fr_fr: Fonctions aléatoires pour différentes distributions et motifs de bruit.
zh_cn: 用于不同分布和噪声模式的随机函数。

source: ❤️ Health
fr_fr: ❤️ Santé
zh_cn: ❤️ 生命

source: Easily manage the health of a player or the lifetime of an entity!
fr_fr: Gérez facilement la santé d'un joueur ou la durée de vie d'une entité !
zh_cn: 轻松管理玩家的生命值或实体的生命周期！

source: 📖 Key Definitions
fr_fr: 📖 Définitions clés
zh_cn: 📖 关键概念

source: General Concepts
fr_fr: Concepts généraux
zh_cn: 通用概念

source: **Bundle**
zh_cn: **捆绑包**

source: A set of modules packaged together for distribution.
fr_fr: Un ensemble de modules empaquetés ensemble pour la distribution.
zh_cn: 一组打包在一起用于分发的模块。

source: **Dependency**
fr_fr: **Dépendance**
zh_cn: **依赖项**

source: A module that another module relies on to function properly. It must be loaded for the dependent module to work.
fr_fr: Un module sur lequel un autre module s'appuie pour fonctionner correctement. Il doit être chargé pour que le module dépendant fonctionne.
zh_cn: 其他模块正常运行所依赖的模块。依赖项必须被加载才能让依赖它的模块正常工作。

source: **Feature**
zh_cn: **特性**

source: A user-facing element designed to accomplish a task. Features are often represented as function tags, but can also include loot tables, structures, predicates, and more.
fr_fr: Un élément orienté utilisateur conçu pour accomplir une tâche. Les features sont souvent représentées comme des tags de fonction, mais peuvent aussi inclure des loot tables, structures, prédicats, et plus.
zh_cn: 一个面向用户的、用于完成特定任务的元素。特性通常表现为函数标签，但也可以包括战利品表、结构、谓词等。

source: **Module**
zh_cn: **模块**

source: A collection of related features within a namespace, serving a specific purpose.
fr_fr: Une collection de features liées au sein d'un espace de noms, servant un objectif spécifique.
zh_cn: 在同一命名空间内服务于特定目的的相关特性的集合。

source: **Weak Dependency**
fr_fr: **Dépendance faible**
zh_cn: **弱依赖项**

source: An optional dependency that enhances functionality if present, but is not essential for the main module to function correctly.
fr_fr: Une dépendance optionnelle qui améliore les fonctionnalités si présente, mais n'est pas essentielle pour que le module principal fonctionne correctement.
zh_cn: 可选的依赖项，存在时可以增强功能，但对主模块的正常运行不是必需的。

source: Special Arguments
fr_fr: Arguments spéciaux
zh_cn: 特殊参数

source: Specifies a command to be executed by a feature when a particular event occurs.
fr_fr: Spécifie une commande à exécuter par une feature lorsqu'un événement particulier se produit.
zh_cn: 指定在特定事件发生时由特性执行的命令。

source: Specifies a command to be executed by a feature, often immediately.
fr_fr: Spécifie une commande à exécuter par une feature, souvent immédiatement.
zh_cn: 指定由特性执行的命令，通常是立即执行。

source: Specifies optional arguments.
fr_fr: Spécifie des arguments optionnels.
zh_cn: 指定可选参数。

source: Special Functions
fr_fr: Fonctions spéciales
zh_cn: 特殊函数

source: Shortened from "as to at." These functions take two positions: one given through a positional argument (e.g., `positioned`, `at`), and the other from the executor's position.
fr_fr: Abrégé de "as to at". Ces fonctions prennent deux positions : une donnée par un argument positionnel (ex. `positioned`, `at`), et l'autre depuis la position de l'exécuteur.
zh_cn: 缩写自“as to at”。这些函数接受两个位置：一个通过位置参数给出（如 `positioned`、`at`），另一个来自执行者的位置。
