Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/modules/vector.po
Languages: fr_fr

source: ➡️ Vector
fr_fr: ➡️ Vecteur

source: Vectors are fundamental and incredibly powerful tools to manage motions, forces and... well... do physics!
fr_fr: Les vecteurs sont des outils fondamentaux et incroyablement puissants pour gérer les mouvements, les forces et... eh bien... faire de la physique !

source: <svg version="1.1" width="1.0em" height="1.0em" class="sd-octicon sd-octicon-device-camera-video" viewBox="0 0 16 16" aria-hidden="true"><path d="M16 3.75v8.5a.75.75 0 0 1-1.136.643L11 10.575v.675A1.75 1.75 0 0 1 9.25 13h-7.5A1.75 1.75 0 0 1 0 11.25v-6.5C0 3.784.784 3 1.75 3h7.5c.966 0 1.75.784 1.75 1.75v.675l3.864-2.318A.75.75 0 0 1 16 3.75Zm-6.5 1a.25.25 0 0 0-.25-.25h-7.5a.25.25 0 0 0-.25.25v6.5c0 .138.112.25.25.25h7.5a.25.25 0 0 0 .25-.25v-6.5ZM11 8.825l3.5 2.1v-5.85l-3.5 2.1Z"></path></svg> Watch a demo
fr_fr: <svg version="1.1" width="1.0em" height="1.0em" class="sd-octicon sd-octicon-device-camera-video" viewBox="0 0 16 16" aria-hidden="true"><path d="M16 3.75v8.5a.75.75 0 0 1-1.136.643L11 10.575v.675A1.75 1.75 0 0 1 9.25 13h-7.5A1.75 1.75 0 0 1 0 11.25v-6.5C0 3.784.784 3 1.75 3h7.5c.966 0 1.75.784 1.75 1.75v.675l3.864-2.318A.75.75 0 0 1 16 3.75Zm-6.5 1a.25.25 0 0 0-.25-.25h-7.5a.25.25 0 0 0-.25.25v6.5c0 .138.112.25.25.25h7.5a.25.25 0 0 0 .25-.25v-6.5ZM11 8.825l3.5 2.1v-5.85l-3.5 2.1Z"></path></svg> Regarder une démo

source: "With vectors, physics has found a magnificent language."
fr_fr: « Avec les vecteurs, la physique a trouvé un langage magnifique. »

source: 🔧 Functions
fr_fr: 🔧 Fonctions

source: You can find below all functions available in this module.
fr_fr: Vous pouvez trouver ci-dessous toutes les fonctions disponibles dans ce module.

source: Absolute Max
fr_fr: Maximum absolu

source: Get the number furthest to zero, regardless of sign.
fr_fr: Obtenir le nombre le plus éloigné de zéro, sans tenir compte du signe.

source: Inputs
fr_fr: Entrées

source: **Scores `$vector.abs_max.[0,1,2] bs.in`**: Vector components.
fr_fr: **Scores `$vector.abs_max.[0,1,2] bs.in`** : Composantes du vecteur.

source: Outputs
fr_fr: Sorties

source: **Return | Score `$vector.abs_max bs.out`**: Component with the value furthest from 0.
fr_fr: **Retour | Score `$vector.abs_max bs.out`** : Composante avec la valeur la plus éloignée de 0.

source: *Example: I want to get the max component of the vector (1000, 2000, 3000):*
fr_fr: *Exemple : Je veux obtenir la composante max du vecteur (1000, 2000, 3000) :*

source: **Credits**: Aksiome, Leirof
fr_fr: **Crédits** : Aksiome, Leirof

source: Absolute Min
fr_fr: Minimum absolu

source: Get the number closest to zero, regardless of sign.
fr_fr: Obtenir le nombre le plus proche de zéro, sans tenir compte du signe.

source: **Scores `$vector.abs_min.[0,1,2] bs.in`**: Vector components.
fr_fr: **Scores `$vector.abs_min.[0,1,2] bs.in`** : Composantes du vecteur.

source: **Return | Score `$vector.abs_min bs.out`**: Component with the value closest to 0.
fr_fr: **Retour | Score `$vector.abs_min bs.out`** : Composante avec la valeur la plus proche de 0.

source: *Example: I want to get the min component of the vector (1000, 2000, 3000):*
fr_fr: *Exemple : Je veux obtenir la composante min du vecteur (1000, 2000, 3000) :*

source: **Credits**: Aksiome
fr_fr: **Crédits** : Aksiome

source: Basis Rotation 3D
fr_fr: Rotation de base 3D

source: Get the equivalent of the vector passed in parameter in a base with a different rotation. Useful to convert absolute/relative positions into local positions.
fr_fr: Obtenir l'équivalent du vecteur passé en paramètre dans une base avec une rotation différente. Utile pour convertir les positions absolues/relatives en positions locales.

source: **Scores `$vector.basis_rot_3d.pos.[0,1,2] bs.in`**: Vector coordinates $=(X,Y,Z)$ in the starting base.
fr_fr: **Scores `$vector.basis_rot_3d.pos.[0,1,2] bs.in`** : Coordonnées du vecteur $=(X,Y,Z)$ dans la base de départ.

source: **Scores `$vector.basis_rot_3d.rot.[0,1] bs.in`**: Horizontal angle $=\phi$ (along $=\hat{y}$) and vertical angle $=\theta$ (along $=\hat{\phi}$) rotation (in degree) from the starting base.
fr_fr: **Scores `$vector.basis_rot_3d.rot.[0,1] bs.in`** : Angle horizontal $=\phi$ (le long de $=\hat{y}$) et angle vertical $=\theta$ (le long de $=\hat{\phi}$) de rotation (en degrés) depuis la base de départ.

source: **Function macro**:
fr_fr: **Macro de fonction** :

source: **Scores `$vector.basis_rot_3d.[0,1,2] bs.out`**: Vector coordinates $=(X',Y',Z')$ in the target base.
fr_fr: **Scores `$vector.basis_rot_3d.[0,1,2] bs.out`** : Coordonnées du vecteur $=(X',Y',Z')$ dans la base cible.

source: Basis System
fr_fr: Système de base

source: This system uses the Minecraft coordinate system. Thus:
fr_fr: Ce système utilise le système de coordonnées Minecraft. Ainsi :

source: $\hat{y}$ is the vertical axis.
fr_fr: $\hat{y}$ est l'axe vertical.

source: $\phi=0$ (starting point of the horizontal angle) is along the $\hat{z}$ axis.
fr_fr: $\phi=0$ (point de départ de l'angle horizontal) est le long de l'axe $\hat{z}$.

source: $\theta=0$ (starting point of the vertical angle) is on the horizontal plane.
fr_fr: $\theta=0$ (point de départ de l'angle vertical) est sur le plan horizontal.

source: *Example: A block is located at ~2 ~5 ~10 relative to me, I want to have this position in local coordinate (^? ^? ^?):*
fr_fr: *Exemple : Un bloc est situé à ~2 ~5 ~10 par rapport à moi, je veux avoir cette position en coordonnées locales (^? ^? ^?) :*

source: *Example: I want to have a vector pointing to where I'm looking at, but in relative coordinates ~X ~Y ~Z:*
fr_fr: *Exemple : Je veux avoir un vecteur pointant vers l'endroit où je regarde, mais en coordonnées relatives ~X ~Y ~Z :*

source: Cartesian to Spherical
fr_fr: Cartésien vers sphérique

source: Convert cartesian coordinates to spherical coordinates.
fr_fr: Convertir les coordonnées cartésiennes en coordonnées sphériques.

source: **Scores `$vector.cartesian_to_spherical.[0,1,2] bs.in`**: Vector representing the cartesian coordinates $=(X,Y,Z)$.
fr_fr: **Scores `$vector.cartesian_to_spherical.[0,1,2] bs.in`** : Vecteur représentant les coordonnées cartésiennes $=(X,Y,Z)$.

source: **Scores `$vector.cartesian_to_spherical.[0,1,2] bs.out`**: Vector representing the spherical coordinates $=(H,V,R)$.
fr_fr: **Scores `$vector.cartesian_to_spherical.[0,1,2] bs.out`** : Vecteur représentant les coordonnées sphériques $=(H,V,R)$.

source: Spherical Coordinates
fr_fr: Coordonnées sphériques

source: This system returns non conventional [spherical coordinates](https://en.wikipedia.org/wiki/Spherical_coordinate_system).
fr_fr: Ce système retourne des [coordonnées sphériques](https://en.wikipedia.org/wiki/Spherical_coordinate_system) non conventionnelles.

source: $H$ (horizontal angle) is along the $\hat{z}$ axis.
fr_fr: $H$ (angle horizontal) est le long de l'axe $\hat{z}$.

source: $V$ (vertical angle) is on the horizontal plane.
fr_fr: $V$ (angle vertical) est sur le plan horizontal.

source: $R$ is the radial distance.
fr_fr: $R$ est la distance radiale.

source: *Example: I want to convert the vector (1000, 2000, 3000) to spherical coordinates:*
fr_fr: *Exemple : Je veux convertir le vecteur (1000, 2000, 3000) en coordonnées sphériques :*

source: Cross Product
fr_fr: Produit vectoriel

source: Compute the vector product between $u$ and $v$.
fr_fr: Calculer le produit vectoriel entre $u$ et $v$.

source: **Scores `$vector.cross_product.u.[0,1,2] bs.in`**: First vector components.
fr_fr: **Scores `$vector.cross_product.u.[0,1,2] bs.in`** : Composantes du premier vecteur.

source: **Scores `$vector.cross_product.v.[0,1,2] bs.in`**: Second vector components.
fr_fr: **Scores `$vector.cross_product.v.[0,1,2] bs.in`** : Composantes du second vecteur.

source: **Scores `$vector.cross_product.[0,1,2] bs.out`**: Result of the operation $=u \times v$.
fr_fr: **Scores `$vector.cross_product.[0,1,2] bs.out`** : Résultat de l'opération $=u \times v$.

source: *Example: I want to perform $u \times v$ with $u=(1,2,3)$ and $v=(4,5,6):*
fr_fr: *Exemple : Je veux effectuer $u \times v$ avec $u=(1,2,3)$ et $v=(4,5,6)$ :*

source: **Credits**: Aksiome, Majoras16
fr_fr: **Crédits** : Aksiome, Majoras16

source: Dot Product
fr_fr: Produit scalaire

source: Compute the scalar product between $u$ and $v$.
fr_fr: Calculer le produit scalaire entre $u$ et $v$.

source: **Scores `$vector.dot_product.u.[0,1,2] bs.in`**: First vector components.
fr_fr: **Scores `$vector.dot_product.u.[0,1,2] bs.in`** : Composantes du premier vecteur.

source: **Scores `$vector.dot_product.v.[0,1,2] bs.in`**: Second vector components.
fr_fr: **Scores `$vector.dot_product.v.[0,1,2] bs.in`** : Composantes du second vecteur.

source: **Scores `$vector.dot_product bs.out`**: Result of the operation $=u · v$.
fr_fr: **Score `$vector.dot_product bs.out`** : Résultat de l'opération $=u · v$.

source: *Example: I want to perform $u \cdot v$ with $u=(1,2,3)$ and $v=(4,5,6):*
fr_fr: *Exemple : Je veux effectuer $u \cdot v$ avec $u=(1,2,3)$ et $v=(4,5,6)$ :*

source: Length
fr_fr: Longueur

source: Compute the norm of the vector.
fr_fr: Calculer la norme du vecteur.

source: **Scores `$vector.length.[0,1,2] bs.in`**: Vector components.
fr_fr: **Scores `$vector.length.[0,1,2] bs.in`** : Composantes du vecteur.

source: **Return | Score `$vector.length bs.out`**: Vector length.
fr_fr: **Retour | Score `$vector.length bs.out`** : Longueur du vecteur.

source: *Example: Compute the length of a vector:*
fr_fr: *Exemple : Calculer la longueur d'un vecteur :*

source: Performance Tip
fr_fr: Conseil de performance

source: To minimize performance impact, we recommend using the `length_squared` function instead of this one when possible. Computing the length of a vector requires a square root operation, which is computationally intensive, especially in Minecraft.
fr_fr: Pour minimiser l'impact sur les performances, nous recommandons d'utiliser la fonction `length_squared` à la place de celle-ci quand c'est possible. Calculer la longueur d'un vecteur nécessite une opération de racine carrée, qui est coûteuse en calcul, surtout dans Minecraft.

source: `length_squared` can be used effectively in these cases:
fr_fr: `length_squared` peut être utilisé efficacement dans ces cas :

source: When comparing a vector's length with a given value, compute the square of the given value manually and compare it with the result of `length_squared`.
fr_fr: Lors de la comparaison de la longueur d'un vecteur avec une valeur donnée, calculez manuellement le carré de la valeur donnée et comparez-le avec le résultat de `length_squared`.

source: When comparing the lengths of two vectors, compare their `length_squared` results instead of computing their actual lengths.
fr_fr: Lors de la comparaison des longueurs de deux vecteurs, comparez leurs résultats `length_squared` au lieu de calculer leurs longueurs réelles.

source: Length Squared
fr_fr: Longueur au carré

source: Compute the squared norm of the vector.
fr_fr: Calculer la norme au carré du vecteur.

source: **Scores `$vector.length_squared.[0,1,2] bs.in`**: Vector components.
fr_fr: **Scores `$vector.length_squared.[0,1,2] bs.in`** : Composantes du vecteur.

source: **Return | Score `$vector.length_squared bs.out`**: Vector length squared.
fr_fr: **Retour | Score `$vector.length_squared bs.out`** : Longueur au carré du vecteur.

source: *Example: Compute the squared length of a vector:*
fr_fr: *Exemple : Calculer la longueur au carré d'un vecteur :*

source: Normalize
fr_fr: Normaliser

source: Norm
fr_fr: Norme

source: Normalize the vector by putting the length at the given scale while keeping proportions.
fr_fr: Normaliser le vecteur en fixant la longueur à l'échelle donnée tout en conservant les proportions.

source: **Scores `$vector.normalize.[0,1,2] bs.in`**: Vector components.
fr_fr: **Scores `$vector.normalize.[0,1,2] bs.in`** : Composantes du vecteur.

source: **Scores `$vector.normalize.[0,1,2] bs.out`**: Normalized vector components.
fr_fr: **Scores `$vector.normalize.[0,1,2] bs.out`** : Composantes du vecteur normalisé.

source: Vector normalization doesn't always require using the length. Often, the `normalize_max_component` function can be used instead. While this method doesn't normalize the length, it simplifies operations and improves performance.
fr_fr: La normalisation de vecteur ne nécessite pas toujours d'utiliser la longueur. Souvent, la fonction `normalize_max_component` peut être utilisée à la place. Bien que cette méthode ne normalise pas la longueur, elle simplifie les opérations et améliore les performances.

source: *Example: Normalize the vector (1000, 2000, 3000) with a scale of 1000:*
fr_fr: *Exemple : Normaliser le vecteur (1000, 2000, 3000) avec une échelle de 1000 :*

source: Max Component
fr_fr: Composante maximale

source: Normalize the vector by placing the largest component at the given scale while keeping proportions.
fr_fr: Normaliser le vecteur en plaçant la plus grande composante à l'échelle donnée tout en conservant les proportions.

source: **Scores `$vector.normalize_max_component.[0,1,2] bs.in`**: Vector components.
fr_fr: **Scores `$vector.normalize_max_component.[0,1,2] bs.in`** : Composantes du vecteur.

source: **Scores `$vector.normalize_max_component.[0,1,2] bs.out`**: Normalized vector components.
fr_fr: **Scores `$vector.normalize_max_component.[0,1,2] bs.out`** : Composantes du vecteur normalisé.

source: **Score `$vector.normalize_max_component.factor bs.out`**: Normalization factor.
fr_fr: **Score `$vector.normalize_max_component.factor bs.out`** : Facteur de normalisation.

source: *Example: Fast normalize the vector (1000, 2000, 3000) with a scale of 1000:*
fr_fr: *Exemple : Normalisation rapide du vecteur (1000, 2000, 3000) avec une échelle de 1000 :*

source: Spherical to Cartesian
fr_fr: Sphérique vers cartésien

source: Convert spherical coordinates to cartesian coordinates.
fr_fr: Convertir les coordonnées sphériques en coordonnées cartésiennes.

source: **Scores `$vector.spherical_to_cartesian.[0,1,2] bs.in`**: Vector representing the spherical coordinates $=(H,V,R)$.
fr_fr: **Scores `$vector.spherical_to_cartesian.[0,1,2] bs.in`** : Vecteur représentant les coordonnées sphériques $=(H,V,R)$.

source: **Scores `$vector.spherical_to_cartesian.[0,1,2] bs.out`**: Vector representing the cartesian coordinates $=(X,Y,Z)$.
fr_fr: **Scores `$vector.spherical_to_cartesian.[0,1,2] bs.out`** : Vecteur représentant les coordonnées cartésiennes $=(X,Y,Z)$.

source: This system uses non conventional [spherical coordinates](https://en.wikipedia.org/wiki/Spherical_coordinate_system).
fr_fr: Ce système utilise des [coordonnées sphériques](https://en.wikipedia.org/wiki/Spherical_coordinate_system) non conventionnelles.

source: *Example: I want to convert the spherical coordinates $(45°, 30°, 1)$ to cartesian coordinates:*
fr_fr: *Exemple : Je veux convertir les coordonnées sphériques $(45°, 30°, 1)$ en coordonnées cartésiennes :*

source: **💬 Did it help you?**
fr_fr: **💬 Cela vous a-t-il aidé ?**

source: Feel free to leave your questions and feedback below!
fr_fr: N'hésitez pas à laisser vos questions et commentaires ci-dessous !

source: {nbt}`compound` Arguments
fr_fr: Arguments {nbt}`compound`

source: {nbt}`number` **scaling**: Scalar for the function's input and output.
fr_fr: {nbt}`number` **scaling** : Scalaire pour l'entrée et la sortie de la fonction.

source: {nbt}`number` **scale**: Scalar for the function's output.
fr_fr: {nbt}`number` **scale** : Scalaire pour la sortie de la fonction.
