Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/faq.po
Languages: fr_fr, zh_cn

source: Can I use Bookshelf in my project?
fr_fr: Puis-je utiliser Bookshelf dans mon projet ?
zh_cn: 我可以在我的项目中使用Bookshelf吗？

source: Absolutely! Bookshelf is designed to be used in any project. A mention of Bookshelf and/or Gunivers in a message of thanks is always appreciated. Let's keep the open-source world a respectful place 🤗! Additionally, feel free to share your creations with us to let us know how you use the library (and allow us to provide additional visibility to your project).
fr_fr: Absolument ! Bookshelf est conçu pour être utilisé dans n'importe quel projet. Une mention de Bookshelf et/ou Gunivers dans un message de remerciements est toujours appréciée. Gardons le monde open-source respectueux 🤗 ! De plus, n'hésitez pas à partager vos créations avec nous pour nous faire savoir comment vous utilisez la bibliothèque (et nous permettre de donner plus de visibilité à votre projet).
zh_cn: 当然可以！Bookshelf 库被设计用于各种项目。如果你能在致谢中提到 Bookshelf 和/或 Gunivers，我们将非常感激 🤗！让我们共同维护开源世界的友好氛围！此外，欢迎随时向我们分享你的作品，让我们了解你是如何使用该库的（这样我们也能为你的项目提供更多曝光机会）。

source: Is it compatible with other datapacks?
fr_fr: Est-ce compatible avec d'autres datapacks ?
zh_cn: 是否兼容其他数据包？

source: Yes! Bookshelf adheres to constraints that ensure compatibility with most datapacks. All Bookshelf scores, tags, and namespaces start with `bs.` and use fake players whenever possible to avoid conflicts.
fr_fr: Oui ! Bookshelf respecte des contraintes qui assurent la compatibilité avec la plupart des datapacks. Tous les scores, tags et namespaces Bookshelf commencent par `bs.` et utilisent des faux joueurs quand c'est possible pour éviter les conflits.
zh_cn: 是的！Bookshelf遵循多项约束规则，确保与大多数数据包兼容。所有Bookshelf的分数、标签和命名空间均以`bs.`开头，并在可能情况下使用伪玩家(或模拟玩家)以规避冲突。

source: Is it resource-heavy?
fr_fr: Cela consomme-t-il beaucoup de ressources ?
zh_cn: 资源占用高吗？

source: 🧠 CPU Usage
fr_fr: 🧠 Utilisation CPU
zh_cn: 🧠 CPU占用

source: As a library is simply a set of tools that you can call upon, it will not impact CPU performance unless actively used. The CPU impact depends on the functions you invoke and their frequency. The documentation provides warnings and performance tips for functions that may be resource-intensive.
fr_fr: Étant une bibliothèque, c'est simplement un ensemble d'outils que vous pouvez appeler, elle n'impactera pas les performances CPU à moins d'être activement utilisée. L'impact CPU dépend des fonctions que vous invoquez et de leur fréquence. La documentation fournit des avertissements et conseils de performance pour les fonctions pouvant être intensives en ressources.
zh_cn: 作为一个函数库，它本质上是一套可供调用的工具集，除非主动使用，否则不会影响CPU性能。CPU占用取决于你调用的函数及其频率。文档会对可能资源密集型的函数提供警告和性能优化建议。

source: 💾 Memory Usage
fr_fr: 💾 Utilisation mémoire
zh_cn: 💾 内存占用

source: Minecraft parses the entire datapack upon loading, so the number of files is inconsequential. Instructions are lightweight in memory, allowing for numerous functions without a significant increase in RAM usage. Furthermore, Bookshelf's modular nature enables you to select only the modules you require.
fr_fr: Minecraft parse l'intégralité du datapack au chargement, donc le nombre de fichiers est sans conséquence. Les instructions sont légères en mémoire, permettant de nombreuses fonctions sans augmentation significative de l'utilisation de la mémoire RAM. De plus, la nature modulaire de Bookshelf vous permet de sélectionner seulement les modules dont vous avez besoin.
zh_cn: Minecraft在加载时会解析整个数据包，因此文件数量并不重要。指令在内存中非常轻量，即使包含大量函数也不会显著增加RAM占用。此外，Bookshelf的模块化设计使你可以仅选择所需的模块。

source: 💽 Disk Usage
fr_fr: 💽 Utilisation disque
zh_cn: 💽 磁盘占用

source: Bookshelf is compressed into a zip file, making it only a few megabytes in size. If size remains a concern, you can selectively choose the modules you need. Additionally, it's recommended to download Bookshelf from GitHub releases, which provide only essential files, rather than directly from the repository.
fr_fr: Bookshelf est compressé dans un fichier zip, ne faisant que quelques mégaoctets de taille. Si la taille reste une préoccupation, vous pouvez sélectionner les modules dont vous avez besoin. De plus, il est recommandé de télécharger Bookshelf depuis les releases GitHub, qui fournissent seulement les fichiers essentiels, plutôt que directement depuis le dépôt.
zh_cn: Bookshelf压缩为zip文件后仅有几MB大小。如果仍然关心体积，你可以选择性提取所需模块。建议从GitHub发布页下载（仅包含必需文件），而非直接从代码库下载。

source: Are the functions optimized?
fr_fr: Les fonctions sont-elles optimisées ?
zh_cn: 函数优化如何？

source: Bookshelf prioritizes accessibility and versatility. While this may occasionally result in choices that are not the most optimized for a specific context, they align with the library's objectives. Nevertheless, optimization is continually considered, and suggestions and pull requests to enhance Bookshelf are welcomed. If you have ideas for improvement (optimization, accessibility, or otherwise), please share them with us!
fr_fr: Bookshelf privilégie l'accessibilité et la polyvalence. Bien que cela puisse parfois aboutir à des choix qui ne sont pas les plus optimisés pour un contexte spécifique, ils s'alignent avec les objectifs de la bibliothèque. Néanmoins, l'optimisation est continuellement considérée, et les suggestions et pull requests pour améliorer Bookshelf sont les bienvenues. Si vous avez des idées d'amélioration (optimisation, accessibilité, ou autre), veuillez les partager avec nous !
zh_cn: Bookshelf优先考虑易用性和多功能性。虽然这可能导致某些设计在特定场景下并非最优，但符合函数库的核心目标。我们持续进行优化改进，欢迎提出优化建议和提交PR。无论是对性能、易用性或其他方面的改进想法，都请与我们分享！

source: What about copyrights?
fr_fr: Qu'en est-il des droits d'auteur ?
zh_cn: 版权问题如何处理？

source: Bookshelf is licensed to allow you to use and modify it for personal use and distribute maps or datapacks that use Bookshelf without any issues, as long as you share any modification made to the original source code. For that, we chose the [MPL 2.0](https://github.com/mcbookshelf/bookshelf/blob/master/LICENSE) (Mozilla Public License 2.0).
fr_fr: Bookshelf est sous licence pour vous permettre de l'utiliser et le modifier pour un usage personnel et distribuer des maps ou datapacks qui utilisent Bookshelf sans problème, tant que vous partagez toute modification apportée au code source original. Pour cela, nous avons choisi la [MPL 2.0](https://github.com/mcbookshelf/bookshelf/blob/master/LICENSE) (Mozilla Public License 2.0).
zh_cn: Bookshelf采用[MPL 2.0](https://github.com/mcbookshelf/bookshelf/blob/master/LICENSE)(Mozilla公共许可证2.0)授权。你可自由使用和修改它制作个人项目，并分发包含Bookshelf的地图或数据包，唯一要求是共享对源代码的任何修改。

source: More questions? Join us on Discord!
fr_fr: Plus de questions ? Rejoignez-nous sur Discord !
zh_cn: 还有疑问？加入我们的Discord社区！

source: **💬 Did it help you?**
fr_fr: **💬 Cela vous a-t-il aidé ?**
zh_cn: **💬 这对你有帮助吗？**

source: Feel free to leave your questions and feedback below!
fr_fr: N'hésitez pas à laisser vos questions et commentaires ci-dessous !
zh_cn: 欢迎在下方留下你的问题和反馈！
