Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/changelog/v2.0.0.po
Languages: fr_fr, zh_cn

source: **🌱 The Flourishing Update!**
fr_fr: **🌱 La mise à jour Florissante !**
zh_cn: **🌱 繁盛更新！**

source: *This release replants the foundation of the Gunivers Library, growing into something entirely new.*
fr_fr: *Cette version replante les fondations de Gunivers Libs, évoluant vers quelque chose d'entièrement nouveau.*
zh_cn: *这个版本重构了Gunivers库的基础架构，使其焕然新生。*

source: **⚠️ BREAKING CHANGES**: This new version is filled with breaking changes. Since maintaining a list of those became unrealistic, the following changelog only highlights a selection of tweaks and new functionalities.
fr_fr: **⚠️ BREAKING CHANGES** : Cette nouvelle version est remplie de breaking changes. Comme maintenir une liste complète de ceux-ci est devenu irréaliste, le changelog suivant ne met en évidence qu'une sélection d'améliorations et de nouvelles fonctionnalités.
zh_cn: **⚠️ 破坏性变更**：这次新版本包含大量破坏性变更。因为完整列举所有变更不太现实，以下更新日志仅挑选部分优化与新功能进行说明。

source: 🎉 Addition
fr_fr: 🎉 Ajouts
zh_cn: 🎉 新增内容

source: There is now a changelog!
fr_fr: Il y a maintenant un changelog !
zh_cn: 新增更新日志功能！

source: Added player health manipulation.
fr_fr: Ajout de la manipulation de la santé du joueur.
zh_cn: 新增玩家生命值操控功能。

source: Added precise collisions (move, raycast and view).
fr_fr: Ajout des collisions précises (move, raycast et view).
zh_cn: 新增精确碰撞检测（move、raycast和view）。

source: Added float manipulation (frexp and ldexp).
fr_fr: Ajout de la manipulation de nombres à virgule flottante (frexp et ldexp).
zh_cn: 新增浮点数操作（frexp和ldexp）。

source: Added a new hitbox module.
fr_fr: Ajout d'un nouveau module hitbox.
zh_cn: 新增hitbox模块。

source: Added a new raycast module.
fr_fr: Ajout d'un nouveau module raycast.
zh_cn: 新增raycast模块。

source: Added a new sidebar module.
fr_fr: Ajout d'un nouveau module sidebar.
zh_cn: 新增sidebar模块。

source: ⚡ Enhancements
fr_fr: ⚡ Améliorations
zh_cn: ⚡ 优化改进

source: The project has a new fresh identity: Bookshelf.
fr_fr: Le projet a une nouvelle identité toute fraîche : Bookshelf.
zh_cn: 本项目现已全新升级为：Bookshelf。

source: Every module has been reworked for improved accuracy, performance, and/or simplicity.
fr_fr: Chaque module a été retravaillé pour une précision, des performances et/ou une simplicité améliorées.
zh_cn: 所有模块均已完成重构，在精确性、性能和/或简洁性方面均有提升。

source: Renamed almost everything (scores, objectives, functions, ...).
fr_fr: Renommage de presque tout (scores, objectifs, fonctions, ...).
zh_cn: 全面更新命名（分数、记分项、函数……）。

source: Many functions now utilize macros, storage, or fake scores instead of objectives.
fr_fr: De nombreuses fonctions utilisent maintenant des macros, du storage ou de faux scores au lieu d'objectifs.
zh_cn: 许多函数现在改用宏、命令存储或虚拟分数，而不再使用记分项。

source: Removed the core module. The library no longer requires a base module.
fr_fr: Suppression du module core. La bibliothèque ne nécessite plus de module de base.
zh_cn: 移除了core模块。该库不再需要依赖base模块。

source: Removed outdated modules (cache, item, mapedit, and memory).
fr_fr: Suppression des modules obsolètes (cache, item, mapedit et memory).
zh_cn: 移除过时模块（cache、item、mapedit和memory）。

source: Merged the location and orientation modules into a new position module.
fr_fr: Fusion des modules location et orientation en un nouveau module position.
zh_cn: 合并location和orientation模块为新的position模块。

source: Bitwise operations have been moved out of the math module into a separate module.
fr_fr: Les opérations bitwise ont été déplacées hors du module math dans un module séparé.
zh_cn: 位运算被从math模块独立出来，成为单独的模块。

source: Enhanced the accuracy of the move and view modules due to their rework and the addition of the new hitbox module.
fr_fr: Amélioration de la précision des modules move et view grâce à leur refonte et à l'ajout du nouveau module hitbox.
zh_cn: 得益于重构工作与新增的hitbox模块，move和view模块的精确性显著提升。

source: The schedule module now maintains the current execution context.
fr_fr: Le module schedule maintient maintenant le contexte d'exécution actuel.
zh_cn: schedule模块现在会保持当前的执行上下文。

source: 🐛 Bug Fixes
fr_fr: 🐛 Corrections de bugs
zh_cn: 🐛 漏洞修复

source: Who knows at this point 🤷‍♂️, almost no legacy code remains...
fr_fr: Qui sait à ce stade 🤷‍♂️, presque aucun code historique ne reste...
zh_cn: 到现在谁还说得准呢 🤷‍♂️，祖传代码没剩多少了...
