Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/changelog/v2.2.0.po
Languages: fr_fr

source: **🪐 The Dimensional Update!**
fr_fr: **🪐 La mise à jour Dimensionnelle !**

source: *This release introduces new modules for random distribution and terrain generation, improves existing modules, boosts performance, and fixes minor bugs. All > functions now work seamlessly across all dimensions.*
fr_fr: *Cette version introduit de nouveaux modules pour la distribution aléatoire et la génération de terrain, améliore les modules existants, augmente les performances, et corrige des bugs mineurs. Toutes les fonctions fonctionnent maintenant parfaitement dans toutes les dimensions.*

source: Bookshelf is now based on **Minecraft 1.21.3**.
fr_fr: Bookshelf est maintenant basé sur **Minecraft 1.21.3**.

source: ⚡ **[#265](https://github.com/mcbookshelf/bookshelf/pull/265)** - Load tags do not load modules in isolation anymore. This can now be done using the `exclusive_load` tag.
fr_fr: ⚡ **[#265](https://github.com/mcbookshelf/bookshelf/pull/265)** - Les tags de chargement ne chargent plus les modules de manière isolée. Cela peut maintenant être fait en utilisant le tag `exclusive_load`.

source: 🐛 **[#270](https://github.com/mcbookshelf/bookshelf/issues/270)** - Enabled modules to operate seamlessly across all dimensions.
fr_fr: 🐛 **[#270](https://github.com/mcbookshelf/bookshelf/issues/270)** - Permet aux modules de fonctionner parfaitement dans toutes les dimensions.

source: ✨ **[#222](https://github.com/mcbookshelf/bookshelf/issues/222)** - Added `#bs.block:fill_random` for filling regions with randomly selected blocks.
fr_fr: ✨ **[#222](https://github.com/mcbookshelf/bookshelf/issues/222)** - Ajout de `#bs.block:fill_random` pour remplir des régions avec des blocs sélectionnés aléatoirement.

source: ✨ **[#258](https://github.com/mcbookshelf/bookshelf/issues/258)** - Added `#bs.block:emit_block_particle` to emit block particles in specific locations.
fr_fr: ✨ **[#258](https://github.com/mcbookshelf/bookshelf/issues/258)** - Ajout de `#bs.block:emit_block_particle` pour émettre des particules de bloc à des emplacements spécifiques.

source: ⚡ **[#251](https://github.com/mcbookshelf/bookshelf/issues/251)** - Fill functions now accept `from` and `to` as `[x, y, z]` lists or string coordinates (e.g., `~ ~5 25`).
fr_fr: ⚡ **[#251](https://github.com/mcbookshelf/bookshelf/issues/251)** - Les fonctions de remplissage acceptent maintenant `from` et `to` comme listes `[x, y, z]` ou coordonnées sous forme de chaîne (ex. `~ ~5 25`).

source: 🎉 **[#6](https://github.com/mcbookshelf/bookshelf/issues/6)** - Added module for terrain generation. Supports 2D algorithms for texture and heightmap-based generation.
fr_fr: 🎉 **[#6](https://github.com/mcbookshelf/bookshelf/issues/6)** - Ajout d'un module pour la génération de terrain. Supporte les algorithmes 2D pour la génération basée sur les textures et les heightmaps.

source: 🐛 **[#243](https://github.com/mcbookshelf/bookshelf/issues/243)** - Fixed unload function.
fr_fr: 🐛 **[#243](https://github.com/mcbookshelf/bookshelf/issues/243)** - Correction de la fonction de déchargement.

source: ✨ **[#203](https://github.com/mcbookshelf/bookshelf/issues/203)** - Added `#bs.hitbox:is_entity_in_block` to check if an entity is in a block.
fr_fr: ✨ **[#203](https://github.com/mcbookshelf/bookshelf/issues/203)** - Ajout de `#bs.hitbox:is_entity_in_block` pour vérifier si une entité est dans un bloc.

source: ✨ **[#203](https://github.com/mcbookshelf/bookshelf/issues/203)** - Added `#bs.hitbox:is_entity_in_blocks` to check if an entity is in any block.
fr_fr: ✨ **[#203](https://github.com/mcbookshelf/bookshelf/issues/203)** - Ajout de `#bs.hitbox:is_entity_in_blocks` pour vérifier si une entité est dans n'importe quel bloc.

source: ⚡ **[#252](https://github.com/mcbookshelf/bookshelf/pull/252)** - Optimized module for improved performance.
fr_fr: ⚡ **[#252](https://github.com/mcbookshelf/bookshelf/pull/252)** - Optimisation du module pour améliorer les performances.

source: ⚡ **[#276](https://github.com/mcbookshelf/bookshelf/pull/276)** - Add new hitboxes (new babies and salmon variants).
fr_fr: ⚡ **[#276](https://github.com/mcbookshelf/bookshelf/pull/276)** - Ajout de nouvelles hitboxes (nouveaux bébés et variantes de saumon).

source: 🐛 **[#265](https://github.com/mcbookshelf/bookshelf/pull/265)** - Corrected hitbox for player in spectator mode.
fr_fr: 🐛 **[#265](https://github.com/mcbookshelf/bookshelf/pull/265)** - Correction de la hitbox du joueur en mode spectateur.

source: 🎉 **[#193](https://github.com/mcbookshelf/bookshelf/issues/193)** - Added module to track player actions on interaction entities: left/right click, and hover events.
fr_fr: 🎉 **[#193](https://github.com/mcbookshelf/bookshelf/issues/193)** - Ajout d'un module pour suivre les actions du joueur sur les entités d'interaction : clics gauche/droit et événements de survol.

source: ✨ **[#233](https://github.com/mcbookshelf/bookshelf/issues/233)** - Added `#bs.link:remove_link` to remove specific links.
fr_fr: ✨ **[#233](https://github.com/mcbookshelf/bookshelf/issues/233)** - Ajout de `#bs.link:remove_link` pour supprimer des liens spécifiques.

source: ✨ **[#233](https://github.com/mcbookshelf/bookshelf/issues/233)** - Added `#bs.link:<as|at>_children` and `#bs.link:<as|at>_parent` to handle parent-child link relationships.
fr_fr: ✨ **[#233](https://github.com/mcbookshelf/bookshelf/issues/233)** - Ajout de `#bs.link:<as|at>_children` et `#bs.link:<as|at>_parent` pour gérer les relations de liens parent-enfant.

source: ✨ **[#171](https://github.com/mcbookshelf/bookshelf/issues/171)** - Added logging functions `#bs.log:history` and `#bs.log:clear_history` for viewing and clearing log history.
fr_fr: ✨ **[#171](https://github.com/mcbookshelf/bookshelf/issues/171)** - Ajout des fonctions de logs `#bs.log:history` et `#bs.log:clear_history` pour visualiser et effacer l'historique des logs.

source: ⚡ **[#247](https://github.com/mcbookshelf/bookshelf/pull/247)** - Improved the default `bs.log` format for clarity.
fr_fr: ⚡ **[#247](https://github.com/mcbookshelf/bookshelf/pull/247)** - Amélioration du format par défaut de `bs.log` pour plus de clarté.

source: ⚡ **[#265](https://github.com/mcbookshelf/bookshelf/pull/265)** - Enabled the module to work reliably at high coordinates with improved and more robust collision detection.
fr_fr: ⚡ **[#265](https://github.com/mcbookshelf/bookshelf/pull/265)** - Activation du module pour fonctionner de manière fiable à des coordonnées élevées avec une détection de collision améliorée et plus robuste.

source: 🐛 **[#255](https://github.com/mcbookshelf/bookshelf/issues/255)** - Fixed local velocity collisions.
fr_fr: 🐛 **[#255](https://github.com/mcbookshelf/bookshelf/issues/255)** - Correction des collisions de vitesse locale.

source: 🐛 **[#262](https://github.com/mcbookshelf/bookshelf/pull/262)** - Resolved collision issues with paintings.
fr_fr: 🐛 **[#262](https://github.com/mcbookshelf/bookshelf/pull/262)** - Résolution des problèmes de collision avec les peintures.

source: 🎉 **[#1](https://github.com/mcbookshelf/bookshelf/issues/1)** / **[#220](https://github.com/mcbookshelf/bookshelf/issues/220)** - Added module, which includes random distributions, noise generation, and random selection of an element from a list.
fr_fr: 🎉 **[#1](https://github.com/mcbookshelf/bookshelf/issues/1)** / **[#220](https://github.com/mcbookshelf/bookshelf/issues/220)** - Ajout d'un module qui inclut les distributions aléatoires, la génération de bruit et la sélection aléatoire d'un élément dans une liste.

source: ✨ **[#245](https://github.com/mcbookshelf/bookshelf/issues/245)** - Added `piercing` and callback options to `#bs.raycast:run`.
fr_fr: ✨ **[#245](https://github.com/mcbookshelf/bookshelf/issues/245)** - Ajout des options `piercing` et de callback à `#bs.raycast:run`.

source: ⚡ **[#265](https://github.com/mcbookshelf/bookshelf/pull/265)** - Optimized module for improved performance.
fr_fr: ⚡ **[#265](https://github.com/mcbookshelf/bookshelf/pull/265)** - Optimisation du module pour améliorer les performances.

source: 🐛 **[#254](https://github.com/mcbookshelf/bookshelf/issues/254)** - Resolved execution loop interruptions caused by callbacks.
fr_fr: 🐛 **[#254](https://github.com/mcbookshelf/bookshelf/issues/254)** - Résolution des interruptions de boucle d'exécution causées par les callbacks.

source: 🐛 **[#264](https://github.com/mcbookshelf/bookshelf/issues/264)** - Resolved compatibility issues with the schedule module outside the overworld.
fr_fr: 🐛 **[#264](https://github.com/mcbookshelf/bookshelf/issues/264)** - Résolution des problèmes de compatibilité avec le module schedule en dehors de l'overworld.

source: 🐛 **[#256](https://github.com/mcbookshelf/bookshelf/issues/256)** - Fixed progress bar boundary issues at 0% and 100%.
fr_fr: 🐛 **[#256](https://github.com/mcbookshelf/bookshelf/issues/256)** - Correction des problèmes de limites de la barre de progression à 0% et 100%.
