Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/changelog/v3.0.0.po
Languages: fr_fr, zh_cn

source: <abbr title="Breaking Changes">⚠️</abbr> **[#282](https://github.com/mcbookshelf/bookshelf/issues/282)** - Changed the `schedule` function signature for better consistency with others that use callbacks.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#282](https://github.com/mcbookshelf/bookshelf/issues/282)** - Modification de la signature de la fonction `schedule` pour une meilleure cohérence avec les autres qui utilisent des callbacks.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#282](https://github.com/mcbookshelf/bookshelf/issues/282)** - 修改 `schedule` 函数签名以保持与其他回调函数的一致性。

source: <abbr title="Enhancements">⚡</abbr> **[#367](https://github.com/mcbookshelf/bookshelf/issues/367)** - Optimized the module for the 1.21.5 version of Minecraft.
fr_fr: <abbr title="Améliorations">⚡</abbr> **[#367](https://github.com/mcbookshelf/bookshelf/issues/367)** - Optimisation du module pour la version 1.21.5 de Minecraft.
zh_cn: <abbr title="优化改进">⚡</abbr> **[#367](https://github.com/mcbookshelf/bookshelf/issues/367)** - 对模块进行优化以适配 Minecraft 1.21.5 版本。

source: <abbr title="Bug Fix">🐛</abbr> **[#301](https://github.com/mcbookshelf/bookshelf/pull/301)** - Fixed the issue where `bs.sidebar:create` was not functioning correctly.
fr_fr: <abbr title="Correction de Bugs">🐛</abbr> **[#301](https://github.com/mcbookshelf/bookshelf/pull/301)** - Correction du problème où `bs.sidebar:create` ne fonctionnait pas correctement.
zh_cn: <abbr title="漏洞修复">🐛</abbr> **[#301](https://github.com/mcbookshelf/bookshelf/pull/301)** - 修复 `bs.sidebar:create` 功能异常的漏洞。

source: <abbr title="New Modules">🎉</abbr> **[#283](https://github.com/mcbookshelf/bookshelf/pull/283)** - Added a new `bs.string` module for managing strings.
fr_fr: <abbr title="Nouveaux Modules">🎉</abbr> **[#283](https://github.com/mcbookshelf/bookshelf/pull/283)** - Ajout d'un nouveau module `bs.string` pour gérer les chaînes de caractères.
zh_cn: <abbr title="新增模块">🎉</abbr> **[#283](https://github.com/mcbookshelf/bookshelf/pull/283)** - 新增用于管理字符串的 `bs.string` 模块。

source: <abbr title="New Modules">🎉</abbr> **[#241](https://github.com/mcbookshelf/bookshelf/issues/241)** - Added a new `bs.spline` module for working with splines.
fr_fr: <abbr title="Nouveaux Modules">🎉</abbr> **[#241](https://github.com/mcbookshelf/bookshelf/issues/241)** - Ajout d'un nouveau module `bs.spline` pour travailler avec les splines.
zh_cn: <abbr title="新增模块">🎉</abbr> **[#241](https://github.com/mcbookshelf/bookshelf/issues/241)** - 新增用于处理样条曲线的 `bs.spline` 模块。

source: <abbr title="Bug Fix">🐛</abbr> **[#379](https://github.com/mcbookshelf/bookshelf/issues/379)** - Fixed get time for the 1.21.5 version of Minecraft.
fr_fr: <abbr title="Correction de Bugs">🐛</abbr> **[#379](https://github.com/mcbookshelf/bookshelf/issues/379)** - Correction de l'obtention du temps pour la version 1.21.5 de Minecraft.
zh_cn: <abbr title="漏洞修复">🐛</abbr> **[#379](https://github.com/mcbookshelf/bookshelf/issues/379)** - 修复 Minecraft 1.21.5 版本中获取时间的漏洞。

source: <abbr title="New Features">✨</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - Added the `hitbox_shape` argument to raycast related functions, allowing selection between `collision` and `interaction` shapes.
fr_fr: <abbr title="Nouvelles Fonctionnalités">✨</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - Ajout de l'argument `hitbox_shape` aux fonctions liées au raycast, permettant de sélectionner entre les formes `collision` et `interaction`.
zh_cn: <abbr title="新增功能">✨</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - 为射线投射相关函数新增 `hitbox_shape` 参数，允许在 `collision`（碰撞）和 `interaction`（交互）形状间选择。

source: <abbr title="New Features">✨</abbr> **[#299](https://github.com/mcbookshelf/bookshelf/pull/299)** - Block tag `can_see_through` is now properly documented.
fr_fr: <abbr title="Nouvelles Fonctionnalités">✨</abbr> **[#299](https://github.com/mcbookshelf/bookshelf/pull/299)** - Le tag de bloc `can_see_through` est maintenant correctement documenté.
zh_cn: <abbr title="新增功能">✨</abbr> **[#299](https://github.com/mcbookshelf/bookshelf/pull/299)** - 完善方块标签 `can_see_through` 的文档说明。

source: <abbr title="Bug Fix">🐛</abbr> **[#319](https://github.com/mcbookshelf/bookshelf/issues/319)** - Fixed `can_see_ata` max distance computation.
fr_fr: <abbr title="Correction de Bugs">🐛</abbr> **[#319](https://github.com/mcbookshelf/bookshelf/issues/319)** - Correction du calcul de distance maximale de `can_see_ata`.
zh_cn: <abbr title="漏洞修复">🐛</abbr> **[#319](https://github.com/mcbookshelf/bookshelf/issues/319)** - 修复 `can_see_ata` 最大距离计算错误的漏洞。
