Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/changelog/v3.0.0.po
Languages: fr_fr, zh_cn

source: **🚂 The Pipeline Update!**
fr_fr: **🚂 La mise à jour Pipeline !**
zh_cn: **🚂 管线更新!**

source: *This release overhauls the project structure with Beet, focusing on modularity and isolation of each module. It also introduces a new version loader that resolves conflicts between multiple versions.*
fr_fr: *Cette version réorganise complètement la structure du projet avec Beet, se concentrant sur la modularité et l'isolation de chaque module. Elle introduit également un nouveau chargeur de version qui résout les conflits entre plusieurs versions.*
zh_cn: *本次更新使用 Beet 彻底重构了项目结构，着重于各模块的模块化与隔离性。同时引入了新的版本加载器，可解决多版本间的冲突问题。*

source: **⚠️ BREAKING CHANGES**: This new version has a few breaking changes!
fr_fr: **⚠️ BREAKING CHANGES** : Cette nouvelle version contient quelques changements incompatibles avec les versions précédentes !
zh_cn: **⚠️ 破坏性变更**：这个新版本包含一些破坏性变更！

source: Bookshelf is now based on **Minecraft 1.21.5**. Each module of Bookshelf is now shipped as a separate datapack for people wanting to use only a single module. Introduced bundles to better group modules, replacing **Bookshelf** and **Bookshelf Dev** datapacks: **Bookshelf Runtime**, **Bookshelf Dev**, **Bookshelf Prefabs**, and **Bookshelf Suite**.
fr_fr: Bookshelf est maintenant basé sur **Minecraft 1.21.5**. Chaque module de Bookshelf est maintenant livré comme un datapack séparé pour les personnes voulant utiliser seulement un seul module. Introduction des bundles pour mieux grouper les modules, remplaçant les datapacks **Bookshelf** et **Bookshelf Dev** : **Bookshelf Runtime**, **Bookshelf Dev**, **Bookshelf Prefabs**, et **Bookshelf Suite**.
zh_cn: Bookshelf 现已适配 **Minecraft 1.21.5**。每个模块现以独立数据包形式分发，方便用户按需使用。引入捆绑包机制替代原有的**Bookshelf**和**Bookshelf Dev**数据包，新捆绑包包括：**Bookshelf Runtime**、**Bookshelf Dev**、**Bookshelf Prefabs**和**Bookshelf Suite**。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#281](https://github.com/mcbookshelf/bookshelf/issues/281)** - Merged the `bs.biome` and `bs.weather` modules into a single `bs.environment` module.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#281](https://github.com/mcbookshelf/bookshelf/issues/281)** - Fusion des modules `bs.biome` et `bs.weather` en un seul module `bs.environment`.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#281](https://github.com/mcbookshelf/bookshelf/issues/281)** - 将 `bs.biome` 和 `bs.weather` 模块合并为 `bs.environment` 模块。

source: <abbr title="New Bundles">📦</abbr> **[#323](https://github.com/mcbookshelf/bookshelf/pull/323)** - Introduced bundles to better group modules, replacing **Bookshelf** and **Bookshelf Dev** datapacks: **Bookshelf Runtime**, **Bookshelf Dev**, **Bookshelf Prefabs**, and **Bookshelf Suite**.
fr_fr: <abbr title="Nouveaux Bundles">📦</abbr> **[#323](https://github.com/mcbookshelf/bookshelf/pull/323)** - Introduction des bundles pour mieux grouper les modules, remplaçant les datapacks **Bookshelf** et **Bookshelf Dev** : **Bookshelf Runtime**, **Bookshelf Dev**, **Bookshelf Prefabs**, et **Bookshelf Suite**.
zh_cn: <abbr title="新增捆绑包">📦</abbr> **[#323](https://github.com/mcbookshelf/bookshelf/pull/323)** - 引入捆绑包机制，替代原有的 **Bookshelf** 和 **Bookshelf Dev** 数据包，新捆绑包包括：**Bookshelf Runtime**、**Bookshelf Dev**、**Bookshelf Prefabs** 和 **Bookshelf Suite**。

source: <abbr title="New Modules">🎉</abbr> **[#272](https://github.com/mcbookshelf/bookshelf/issues/272)** - Added an automatically generated `bs.load` module, removing the need for manual `load` and `unload` tags. Bookshelf now also uses **LanternLoad**.
fr_fr: <abbr title="Nouveaux Modules">🎉</abbr> **[#272](https://github.com/mcbookshelf/bookshelf/issues/272)** - Ajout d'un module `bs.load` généré automatiquement, supprimant le besoin de gérer manuellement les tags `load` et `unload`. Bookshelf utilise maintenant **LanternLoad**.
zh_cn: <abbr title="新增模块">🎉</abbr> **[#272](https://github.com/mcbookshelf/bookshelf/issues/272)** - 新增自动生成的 `bs.load` 模块，无需手动管理 `load` 和 `unload` 标签。现采用 **LanternLoad** 加载系统。

source: <abbr title="Enhancements">⚡</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - Removed the need for `__help__` functions and `help` tags. These are now generated.
fr_fr: <abbr title="Améliorations">⚡</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - Suppression du besoin des fonctions `__help__` et des tags `help`. Ceux-ci sont maintenant générés automatiquement.
zh_cn: <abbr title="优化改进">⚡</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - 移除对手动编写 `__help__` 函数和 `help` 标签的需求，现改为自动生成。

source: <abbr title="Documentation">📝</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - Migrated the documentation to **mcbookshelf.dev** and reworked the contribution guide to explain the new **Beet** pipeline.
fr_fr: <abbr title="Documentation">📝</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - Migration de la documentation vers **mcbookshelf.dev** et refonte du guide de contribution pour expliquer la nouvelle pipeline **Beet**.
zh_cn: <abbr title="文档更新">📝</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - 文档已迁移至 **mcbookshelf.dev**，并重写贡献指南以说明新的 **Beet** 工作流程。

source: <abbr title="GitHub & CI/CD">⚙️</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - Created a GitHub organization and transitioned from the **Jupyter Notebook** to **Beet**. Updated the metadata format, added new issue templates, and introduced workflows for automatic deployment to **Modrinth** and **Smithed**. Modules now also require a `README.md` and a `pack.png`.
fr_fr: <abbr title="GitHub & CI/CD">⚙️</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - Création d'une organisation GitHub et transition de **Jupyter Notebook** vers **Beet**. Mise à jour du format de métadonnées, ajout de nouveaux modèles d'issues, et introduction de workflows pour le déploiement automatique vers **Modrinth** et **Smithed**. Les modules nécessitent maintenant un `README.md` et un `pack.png`.
zh_cn: <abbr title="GitHub 与 CI/CD">⚙️</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - 创建 GitHub 组织，从 **Jupyter Notebook** 迁移至 **Beet**。更新元数据格式，新增议题模板，并引入自动部署至 **Modrinth** 和 **Smithed** 的工作流。模块现需包含 `README.md` 和 `pack.png`。

source: <abbr title="Download">📥</abbr> **[#333](https://github.com/mcbookshelf/bookshelf/issues/333)** - Bookshelf now has its own [download manager](https://mcbookshelf.dev), allowing users to select modules along with their dependencies and create custom bundles.
fr_fr: <abbr title="Téléchargement">📥</abbr> **[#333](https://github.com/mcbookshelf/bookshelf/issues/333)** - Bookshelf dispose maintenant de son propre [gestionnaire de téléchargement](https://mcbookshelf.dev), permettant aux utilisateurs de sélectionner des modules avec leurs dépendances et de créer des bundles personnalisés.
zh_cn: <abbr title="下载">📥</abbr> **[#333](https://github.com/mcbookshelf/bookshelf/issues/333)** - Bookshelf 现推出专属[下载管理器](https://mcbookshelf.dev)，支持用户选择模块及其依赖项并创建自定义捆绑包。

source: <abbr title="Download">📥</abbr> **[#336](https://github.com/mcbookshelf/bookshelf/issues/336)** - Bookshelf is now available on **PyPI** for use with the **Beet** toolchain.
fr_fr: <abbr title="Téléchargement">📥</abbr> **[#336](https://github.com/mcbookshelf/bookshelf/issues/336)** - Bookshelf est maintenant disponible sur **PyPI** pour utilisation avec la chaîne d'outils **Beet**.
zh_cn: <abbr title="下载">📥</abbr> **[#336](https://github.com/mcbookshelf/bookshelf/issues/336)** - Bookshelf 现已发布至 **PyPI**，可通过 **Beet** 工具链进行安装。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#375](https://github.com/mcbookshelf/bookshelf/pull/375)** - Changed `get_block` and `get_type` to only return existing data. Empty strings for state or NBT are no longer possible; if absent, the field is omitted instead.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#375](https://github.com/mcbookshelf/bookshelf/pull/375)** - Modification de `get_block` et `get_type` pour ne retourner que les données existantes. Les chaînes vides pour le blockstate ou le NBT ne sont plus possibles ; si absents, le champ est omis.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#375](https://github.com/mcbookshelf/bookshelf/pull/375)** - `get_block` 和 `get_type` 现在只返回现有数据，状态或 NBT 为空时将直接省略对应字段。

source: <abbr title="New Features">✨</abbr> **[#279](https://github.com/mcbookshelf/bookshelf/issues/279)** - Introduced `play_block_sound`, a function for playing block sounds.
fr_fr: <abbr title="Nouvelles Fonctionnalités">✨</abbr> **[#279](https://github.com/mcbookshelf/bookshelf/issues/279)** - Introduction de `play_block_sound`, une fonction pour jouer les sons de blocs.
zh_cn: <abbr title="新增功能">✨</abbr> **[#279](https://github.com/mcbookshelf/bookshelf/issues/279)** - 引入播放方块音效的函数 `play_block_sound`。

source: <abbr title="Bug Fix">🐛</abbr> **[#320](https://github.com/mcbookshelf/bookshelf/issues/320)** - Fixed functions that were previously unusable outside the Overworld.
fr_fr: <abbr title="Correction de Bugs">🐛</abbr> **[#320](https://github.com/mcbookshelf/bookshelf/issues/320)** - Correction des fonctions qui étaient précédemment inutilisables en dehors de l'Overworld.
zh_cn: <abbr title="漏洞修复">🐛</abbr> **[#320](https://github.com/mcbookshelf/bookshelf/issues/320)** - 修复了在主世界外无法使用部分函数的漏洞。

source: <abbr title="Enhancements">⚡</abbr> **[#375](https://github.com/mcbookshelf/bookshelf/pull/375)** - Added default values to `emit_block_particle` and new parameters (`mode`, `viewers`).
fr_fr: <abbr title="Améliorations">⚡</abbr> **[#375](https://github.com/mcbookshelf/bookshelf/pull/375)** - Ajout de valeurs par défaut à `emit_block_particle` et de nouveaux paramètres (`mode`, `viewers`).
zh_cn: <abbr title="优化改进">⚡</abbr> **[#375](https://github.com/mcbookshelf/bookshelf/pull/375)** - 为 `emit_block_particle` 添加默认值及新参数 `mode`、`viewers`。

source: <abbr title="Enhancements">⚡</abbr> **[#363](https://github.com/mcbookshelf/bookshelf/issues/363)** - Enhanced `fill_block`, `fill_type`, `fill_random`, `set_block`, and `set_type` to accept `strict` as a `mode` parameter, allowing control over whether the operation triggers block updates.
fr_fr: <abbr title="Améliorations">⚡</abbr> **[#363](https://github.com/mcbookshelf/bookshelf/issues/363)** - Amélioration de `fill_block`, `fill_type`, `fill_random`, `set_block`, et `set_type` pour accepter `strict` comme paramètre `mode`, permettant de contrôler si l'opération déclenche des mises à jour de blocs.
zh_cn: <abbr title="优化改进">⚡</abbr> **[#363](https://github.com/mcbookshelf/bookshelf/issues/363)** - 增强 `fill_block`、`fill_type`、`fill_random`、`set_block` 及 `set_type` 函数，新增 `strict` 模式参数以控制是否触发方块更新。

source: <abbr title="Enhancements">⚡</abbr> **[#349](https://github.com/mcbookshelf/bookshelf/issues/349)** - Added the `on_finished` argument to fill operations. If specified, the provided command runs automatically when the operation completes.
fr_fr: <abbr title="Améliorations">⚡</abbr> **[#349](https://github.com/mcbookshelf/bookshelf/issues/349)** - Ajout de l'argument `on_finished` aux opérations de remplissage. Si spécifié, la commande fournie s'exécute automatiquement lorsque l'opération se termine.
zh_cn: <abbr title="优化改进">⚡</abbr> **[#349](https://github.com/mcbookshelf/bookshelf/issues/349)** - 为填充操作新增 `on_finished` 参数，当操作完成时将自动执行指定命令。

source: <abbr title="Enhancements">⚡</abbr> **[#287](https://github.com/mcbookshelf/bookshelf/issues/287)** - Updated `replace_type` to return whether a type was found and replaced.
fr_fr: <abbr title="Améliorations">⚡</abbr> **[#287](https://github.com/mcbookshelf/bookshelf/issues/287)** - Mise à jour de `replace_type` pour retourner si un type a été trouvé et remplacé.
zh_cn: <abbr title="优化改进">⚡</abbr> **[#287](https://github.com/mcbookshelf/bookshelf/issues/287)** - `replace_type` 现在会返回类型是否被找到并替换。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - Renamed the `bs.generate` module to `bs.generation`.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - Renommage du module `bs.generate` en `bs.generation`.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - 将 `bs.generate` 模块重命名为 `bs.generation`。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#282](https://github.com/mcbookshelf/bookshelf/issues/282)** - Renamed scores used in callbacks to use the new `bs.lambda` objective.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#282](https://github.com/mcbookshelf/bookshelf/issues/282)** - Renommage des scores utilisés dans les callbacks pour utiliser le nouvel objectif `bs.lambda`.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#282](https://github.com/mcbookshelf/bookshelf/issues/282)** - 回调中使用的分数现改用新的 `bs.lambda` 记分项。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - Renamed the `bs.generate:fractal_shape_2d` function to `bs.generation:gen_fractal_shape_2d`.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - Renommage de la fonction `bs.generate:fractal_shape_2d` en `bs.generation:gen_fractal_shape_2d`.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - 将 `bs.generate:fractal_shape_2d` 函数重命名为 `bs.generation:gen_fractal_shape_2d`。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - Renamed the `bs.generate:shape_2d` function to `bs.generation:gen_shape_2d`.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - Renommage de la fonction `bs.generate:shape_2d` en `bs.generation:gen_shape_2d`.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - 将 `bs.generate:shape_2d` 函数重命名为 `bs.generation:gen_shape_2d`。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - Renamed the `bs.generate:simplex_shape_2d` function to `bs.generation:gen_simplex_shape_2d`.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - Renommage de la fonction `bs.generate:simplex_shape_2d` en `bs.generation:gen_simplex_shape_2d`.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#296](https://github.com/mcbookshelf/bookshelf/issues/296)** - 将 `bs.generate:simplex_shape_2d` 函数重命名为 `bs.generation:gen_simplex_shape_2d`。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#396](https://github.com/mcbookshelf/bookshelf/issues/396)** - Updated the `get_max_health` function to only return the base value, excluding all modifiers.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#396](https://github.com/mcbookshelf/bookshelf/issues/396)** - Mise à jour de la fonction `get_max_health` pour ne retourner que la valeur de base, excluant tous les modificateurs.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#396](https://github.com/mcbookshelf/bookshelf/issues/396)** - 更新 `get_max_health` 函数，现仅返回基础值并排除所有修饰符的影响。

source: <abbr title="Bug Fix">🐛</abbr> **[#348](https://github.com/mcbookshelf/bookshelf/pull/348)** - Fixed an issue where running the heal command in a tick loop caused empty hearts to visually disappear.
fr_fr: <abbr title="Correction de Bugs">🐛</abbr> **[#348](https://github.com/mcbookshelf/bookshelf/pull/348)** - Correction d'un problème où l'exécution de la commande de guérison dans une boucle de tick causait la disparition visuelle des cœurs vides.
zh_cn: <abbr title="漏洞修复">🐛</abbr> **[#348](https://github.com/mcbookshelf/bookshelf/pull/348)** - 修复在游戏刻循环中执行治疗命令导致空心血槽显示异常的漏洞。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - Introduced `collision_shape` for block hitboxes and renamed `shape` to `interaction_shape`.
fr_fr: <abbr title="Nouvelles Fonctionnalités">✨</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - Introduction du tag `#bs.hitbox:is_sized` pour une meilleure gestion des hitboxes.
zh_cn: <abbr title="新增功能">✨</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - 新增 `#bs.hitbox:is_sized` 标签以优化碰撞箱管理。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - Removed `is_in_block` and `is_entity_in_block(s)` functions in favor of `is_in_block_<collision|interaction>` and `is_entity_in_block(s)_<collision|interaction>`.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - Suppression des fonctions `is_in_block` et `is_entity_in_block(s)` au profit de `is_in_block_<collision|interaction>` et `is_entity_in_block(s)_<collision|interaction>`.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - 移除 `is_in_block` 和 `is_entity_in_block(s)` 函数，改用 `is_in_block_<collision|interaction>` 及 `is_entity_in_block(s)_<collision|interaction>` 替代。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#297](https://github.com/mcbookshelf/bookshelf/issues/297)** - Replaced the `is_composite` block tag with `is_full_cube` for better clarity.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#297](https://github.com/mcbookshelf/bookshelf/issues/297)** - Remplacement du tag de bloc `is_composite` par `is_full_cube` pour plus de clarté`.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#297](https://github.com/mcbookshelf/bookshelf/issues/297)** - 将 `is_composite` 方块标签替换为 `is_full_cube` 以提高表述清晰度。

source: <abbr title="New Features">✨</abbr> **[#299](https://github.com/mcbookshelf/bookshelf/pull/299)** - Moved the `#bs.hitbox:can_pass_through` block tag from the move module and documented it.
fr_fr: <abbr title="Nouvelles Fonctionnalités">✨</abbr> **[#299](https://github.com/mcbookshelf/bookshelf/pull/299)** - Déplacement du tag de bloc `#bs.hitbox:can_pass_through` depuis le module move et ajout de sa documentation.
zh_cn: <abbr title="新增功能">✨</abbr> **[#299](https://github.com/mcbookshelf/bookshelf/pull/299)** - 将 `#bs.hitbox:can_pass_through` 方块标签从移动模块迁移至此并进行文档化。

source: <abbr title="New Features">✨</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - Introduced the `#bs.hitbox:is_sized` tag for better hitbox management.
fr_fr: <abbr title="Nouvelles Fonctionnalités">✨</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - Introduction du tag `#bs.hitbox:is_sized` pour une meilleure gestion des hitboxes`.
zh_cn: <abbr title="新增功能">✨</abbr> **[#285](https://github.com/mcbookshelf/bookshelf/pull/285)** - 引入 `#bs.hitbox:is_sized` 标签以优化碰撞箱管理。

source: <abbr title="New Features">✨</abbr> **[#300](https://github.com/mcbookshelf/bookshelf/issues/300)** - Added `bs.interaction.hovered` tag to check if an interaction is currently hovered.
fr_fr: <abbr title="Nouvelles Fonctionnalités">✨</abbr> **[#300](https://github.com/mcbookshelf/bookshelf/issues/300)** - Ajout du tag `bs.interaction.hovered` pour vérifier si une interaction est actuellement survolée.
zh_cn: <abbr title="新增内容">✨</abbr> **[#300](https://github.com/mcbookshelf/bookshelf/issues/300)** - 新增 `bs.interaction.hovered` 标签用于检测交互是否处于悬停状态。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#369](https://github.com/mcbookshelf/bookshelf/issues/369)** - Migrated the `bs.log` module to use SNBT instead of JSON for log messages.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#369](https://github.com/mcbookshelf/bookshelf/issues/369)** - Migration du module `bs.log` pour utiliser SNBT au lieu de JSON pour les messages de log.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#369](https://github.com/mcbookshelf/bookshelf/issues/369)** - 将 `bs.log` 模块的日志消息格式从 JSON 改为 SNBT。

source: <abbr title="Breaking Changes">⚠️</abbr> **[#282](https://github.com/mcbookshelf/bookshelf/issues/282)** - Updated `on_collison` callback: scores now use the `bs.lambda` objective, and the input requires a full command instead of a function path. Additionally, `on_collision/*` functions have been renamed to `callback/*`.
fr_fr: <abbr title="Changements Incompatibles">⚠️</abbr> **[#282](https://github.com/mcbookshelf/bookshelf/issues/282)** - Mise à jour du callback `on_collison` : les scores utilisent maintenant l'objectif `bs.lambda`, et l'entrée nécessite une commande complète au lieu d'un chemin de fonction. De plus, les fonctions `on_collision/*` ont été renommées en `callback/*`.
zh_cn: <abbr title="破坏性变更">⚠️</abbr> **[#282](https://github.com/mcbookshelf/bookshelf/issues/282)** - 更新 `on_collison` 回调：分数现使用 `bs.lambda` 记分项，输入需要完整命令而非函数路径。此外，`on_collision/*` 函数已重命名为 `callback/*`。

source: <abbr title="New Features">✨</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - Added optional `hitbox_shape` parameter to `apply_vel` functions, selecting between `collision` and `interaction` hitboxes.
fr_fr: <abbr title="Nouvelles Fonctionnalités">✨</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - Ajout du paramètre optionnel `hitbox_shape` aux fonctions `apply_vel`, permettant de sélectionner entre les hitboxes `collision` et `interaction`.
zh_cn: <abbr title="新增内容">✨</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - 为 `apply_vel` 函数新增可选 `hitbox_shape` 参数，可选值为 `collision`（碰撞）或 `interaction`（交互）碰撞箱类型。

source: <abbr title="New Features">✨</abbr> **[#298](https://github.com/mcbookshelf/bookshelf/issues/298)** - Predicate `bs.move:has_vel` is now properly documented. hitbox_shape
fr_fr: <abbr title="Nouvelles Fonctionnalités">✨</abbr> **[#298](https://github.com/mcbookshelf/bookshelf/issues/298)** - Le prédicat `bs.move:has_vel` est maintenant correctement documenté.
zh_cn: <abbr title="新增内容">✨</abbr> **[#298](https://github.com/mcbookshelf/bookshelf/issues/298)** - 完善谓词 `bs.move:has_vel` 的文档说明。

source: <abbr title="Bug Fix">🐛</abbr> **[#316](https://github.com/mcbookshelf/bookshelf/issues/316)** - Fixed entities clipping into blocks during collision resolution.
fr_fr: <abbr title="Correction de Bugs">🐛</abbr> **[#316](https://github.com/mcbookshelf/bookshelf/issues/316)** - Correction des entités qui se coinçaient dans les blocs lors de la résolution de collision.
zh_cn: <abbr title="漏洞修复">🐛</abbr> **[#316](https://github.com/mcbookshelf/bookshelf/issues/316)** - 修复碰撞解析过程中实体卡入方块的漏洞。

source: <abbr title="Enhancements">⚡</abbr> **[#358](https://github.com/mcbookshelf/bookshelf/issues/358)** - Added additional lambda values to callbacks.
fr_fr: <abbr title="Améliorations">⚡</abbr> **[#358](https://github.com/mcbookshelf/bookshelf/issues/358)** - Ajout de valeurs lambda supplémentaires aux callbacks.
zh_cn: <abbr title="优化改进">⚡</abbr> **[#358](https://github.com/mcbookshelf/bookshelf/issues/358)** - 为回调新增额外 lambda 值参数。

source: <abbr title="Enhancements">⚡</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - Added the `hitbox_shape` argument to `run`, allowing selection between `collision` and `interaction` shapes.
fr_fr: <abbr title="Améliorations">⚡</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - Ajout de l'argument `hitbox_shape` à `run`, permettant de sélectionner entre les formes `collision` et `interaction`.
zh_cn: <abbr title="优化改进">⚡</abbr> **[#318](https://github.com/mcbookshelf/bookshelf/issues/318)** - 为 `run` 方法添加 `hitbox_shape` 参数，支持在 `collision`（碰撞）和 `interaction`（交互）形状间选择。
