Repository: theogiraudet/Bookshelf
Catalog: docs/_locales/*/LC_MESSAGES/changelog/v3.1.0.po
Languages: fr_fr

source: **💫 The Spatial Update!**
fr_fr: **💫 La mise à jour Spatiale !**

source: *Introduces Moon and Sun position features, as well as fully customizable hitboxes that integrate across the entire Bookshelf ecosystem.*
fr_fr: *Introduit les fonctionnalités de position de la Lune et du Soleil, ainsi que les hitboxes entièrement personnalisables qui s'intègrent dans tout l'écosystème Bookshelf.*

source: Bookshelf is now based on **Minecraft 1.21.8**.
fr_fr: Bookshelf est maintenant basé sur **Minecraft 1.21.8**.

source: <abbr title="Bug Fix">🐛</abbr> **[#469](https://github.com/mcbookshelf/bookshelf/issues/469)** - Fixed missing `execute in minecraft:overworld` when running location-based loot tables.
fr_fr: <abbr title="Bug Fix">🐛</abbr> **[#469](https://github.com/mcbookshelf/bookshelf/issues/469)** - Correction du `execute in minecraft:overworld` manquant lors de l'exécution de tables de butin basées sur la localisation.

source: <abbr title="Bug Fix">🐛</abbr> **[#441](https://github.com/mcbookshelf/bookshelf/issues/441)** - Fixed `#bs.dump:var` incorrectly appending `undefined` to output.
fr_fr: <abbr title="Bug Fix">🐛</abbr> **[#441](https://github.com/mcbookshelf/bookshelf/issues/441)** - Correction de `#bs.dump:var` ajoutant incorrectement `undefined` à la sortie.

source: <abbr title="New Feature">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Added `#bs.environment:get_sun_angle` to get the sun's angle at a specific time on the Y axis relative to the horizon, in degrees.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Ajout de `#bs.environment:get_sun_angle` pour obtenir l'angle du soleil à un moment spécifique sur l'axe Y par rapport à l'horizon, en degrés.

source: <abbr title="New Feature">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Added `#bs.environment:get_moon_angle`to get the moon's angle at a specific time on the Y axis relative to the horizon, in degrees.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Ajout de `#bs.environment:get_moon_angle` pour obtenir l'angle de la lune à un moment spécifique sur l'axe Y par rapport à l'horizon, en degrés.

source: <abbr title="New Feature">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Added `#bs.environment:get_current_sun_angle` to get the current sun's angle on the Y axis relative to the horizon, in degrees.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Ajout de `#bs.environment:get_current_sun_angle` pour obtenir l'angle actuel du soleil sur l'axe Y par rapport à l'horizon, en degrés.

source: <abbr title="New Feature">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Added `#bs.environment:get_current_moon_angle` to get the current moon's angle on the Y axis relative to the horizon, in degrees.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Ajout de `#bs.environment:get_current_moon_angle` pour obtenir l'angle actuel de la lune sur l'axe Y par rapport à l'horizon, en degrés.

source: <abbr title="New Feature">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Added `#bs.environment:get_moon_phase` to get the current moon phase as a string identifier following Minecraft's 8-day lunar cycle.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Ajout de `#bs.environment:get_moon_phase` pour obtenir la phase lunaire actuelle sous forme d'identifiant de chaîne suivant le cycle lunaire de 8 jours de Minecraft.

source: <abbr title="New Feature">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Added `#bs.environment:look_at_sun` to orient the executing entity to look at the sun.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Ajout de `#bs.environment:look_at_sun` pour orienter l'entité exécutante afin qu'elle regarde le soleil.

source: <abbr title="New Feature">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Added `#bs.environment:look_at_moon` to orient the executing entity to look at the moon.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#14](https://github.com/mcbookshelf/bookshelf/issues/14)** - Ajout de `#bs.environment:look_at_moon` pour orienter l'entité exécutante afin qu'elle regarde la lune.

source: <abbr title="New Feature">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Added time-based predicates: `is_day_time`, `is_night_time`, `is_sunrise_time`, `is_sunset_time` for determining current time of day.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Ajout de prédicats basés sur le temps : `is_day_time`, `is_night_time`, `is_sunrise_time`, `is_sunset_time` pour déterminer l'heure actuelle de la journée.

source: <abbr title="New Feature">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Added villagers behavior predicates: `is_villager_working_time`, `is_villager_socializing_time`, `is_villager_sleeping_time` for detecting villager activity phases.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Ajout de prédicats de comportement des villageois : `is_villager_working_time`, `is_villager_socializing_time`, `is_villager_sleeping_time` pour détecter les phases d'activité des villageois.

source: <abbr title="New Feature">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Added beds usage predicate: `is_bed_time` for determining when players can use beds based on weather and time conditions.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Ajout du prédicat d'utilisation des lits : `is_bed_time` pour déterminer quand les joueurs peuvent utiliser les lits selon les conditions météo et de temps.

source: <abbr title="New Feature">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Added mobs behavior predicates: `is_undead_burning_time`, `is_monster_spawning_time` for detecting mob behavior condition according to weather and time.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Ajout de prédicats de comportement des mobs : `is_undead_burning_time`, `is_monster_spawning_time` pour détecter les conditions de comportement des mobs selon la météo et le temps.

source: <abbr title="New Feature">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Added bees behavior predicate: `is_bee_sleeping_time` for detecting time when bees are in their nests/hives.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Ajout du prédicat de comportement des abeilles : `is_bee_sleeping_time` pour détecter le moment où les abeilles sont dans leurs nids/ruches.

source: <abbr title="New Feature">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Added creakings spawning predicate: `is_creaking_spawn_time` for detecting time when creakings can spawn.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#475](https://github.com/mcbookshelf/bookshelf/issues/475)** - Ajout du prédicat de spawn des creakings : `is_creaking_spawn_time` pour détecter le moment où les creakings peuvent apparaître.

source: <abbr title="Bug Fix">🐛</abbr> **[#466](https://github.com/mcbookshelf/bookshelf/issues/466)** - Fixed a bug where healing on Paper servers always set players' health to maximum.
fr_fr: <abbr title="Bug Fix">🐛</abbr> **[#466](https://github.com/mcbookshelf/bookshelf/issues/466)** - Correction d'un bug où la guérison sur les serveurs Paper définissait toujours la santé des joueurs au maximum.

source: <abbr title="New Feature">✨</abbr> **[#465](https://github.com/mcbookshelf/bookshelf/pull/465)** - Added support for custom hitboxes. `#bs.hitbox:get_entity` now also returns `depth` in addition to `width`. For most dynamic entities `depth` equals `width`, except for static entities (e.g. item frames, paintings) and custom hitboxes.
fr_fr: <abbr title="New Feature">✨</abbr> **[#465](https://github.com/mcbookshelf/bookshelf/pull/465)** - Ajout du support pour les hitboxes personnalisées. `#bs.hitbox:get_entity` retourne maintenant aussi `depth` en plus de `width`. Pour la plupart des entités dynamiques `depth` égale `width`, excepté pour les entités statiques (par ex. cadres d'objet, peintures) et les hitboxes personnalisées.

source: <abbr title="Bug Fix">🐛</abbr> **[#463](https://github.com/mcbookshelf/bookshelf/issues/463)** - Fixed an issue where left/right click events could incorrectly target previously clicked entities instead of the current one.
fr_fr: <abbr title="Bug Fix">🐛</abbr> **[#463](https://github.com/mcbookshelf/bookshelf/issues/463)** - Correction d'un problème où les événements de clic gauche/droit pouvaient incorrectement cibler les entités précédemment cliquées au lieu de l'actuelle.

source: <abbr title="New Feature">✨</abbr> **[#465](https://github.com/mcbookshelf/bookshelf/pull/465)** - Optimized bounding box computation for moving entities and added support for baked and custom hitboxes.
fr_fr: <abbr title="New Feature">✨</abbr> **[#465](https://github.com/mcbookshelf/bookshelf/pull/465)** - Optimisation du calcul de la boîte englobante pour les entités en mouvement et ajout du support pour les hitboxes précuites et personnalisées.

source: <abbr title="Bug Fix">🐛</abbr> **[#455](https://github.com/mcbookshelf/bookshelf/issues/455)** – Replaced `/rotate` with `/tp` in `bs.position` to fix jitter and momentum issues.
fr_fr: <abbr title="Bug Fix">🐛</abbr> **[#455](https://github.com/mcbookshelf/bookshelf/issues/455)** – Remplacement de `/rotate` par `/tp` dans `bs.position` pour corriger les problèmes de tremblement et de momentum.

source: <abbr title="New Feature">✨</abbr> **[#286](https://github.com/mcbookshelf/bookshelf/issues/286)** - Added support for **normal distribution** generation to `bs.random` module.
fr_fr: <abbr title="New Feature">✨</abbr> **[#286](https://github.com/mcbookshelf/bookshelf/issues/286)** - Ajout du support pour la génération de **distribution normale** au module `bs.random`.

source: <abbr title="New Feature">✨</abbr> **[#465](https://github.com/mcbookshelf/bookshelf/pull/465)** - Added support for baked and custom entity hitboxes.
fr_fr: <abbr title="New Feature">✨</abbr> **[#465](https://github.com/mcbookshelf/bookshelf/pull/465)** - Ajout du support pour les hitboxes précuites et personnalisées des entités.

source: <abbr title="New Feature">✨</abbr> **[#445](https://github.com/mcbookshelf/bookshelf/issues/445)** - `#bs.raycast:run` now computes all lambda data before invoking callbacks.
fr_fr: <abbr title="New Feature">✨</abbr> **[#445](https://github.com/mcbookshelf/bookshelf/issues/445)** - `#bs.raycast:run` calcule maintenant toutes les données lambda avant d'invoquer les callbacks.

source: <abbr title="Bug Fix">🐛</abbr> **[#457](https://github.com/mcbookshelf/bookshelf/issues/457)** - Fixed raycasts not stopping at the nearest hit when detecting both blocks and entities.
fr_fr: <abbr title="Bug Fix">🐛</abbr> **[#457](https://github.com/mcbookshelf/bookshelf/issues/457)** - Correction des raycasts qui ne s'arrêtaient pas au point de collision le plus proche lors de la détection simultanée de blocs et d'entités.

source: <abbr title="New Feature">✨</abbr> **[#417](https://github.com/mcbookshelf/bookshelf/issues/417)** - Added full support for **linear splines**.
fr_fr: <abbr title="Nouvelle Fonctionnalité">✨</abbr> **[#417](https://github.com/mcbookshelf/bookshelf/issues/417)** - Ajout du support complet pour les **splines linéaires**.
